{"id":60118,"date":"2015-04-09T08:01:56","date_gmt":"2015-04-09T15:01:56","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=60118"},"modified":"2015-04-10T12:46:20","modified_gmt":"2015-04-10T19:46:20","slug":"review-david-malan-cs50-introduction-to-cs","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/","title":{"rendered":"Course Review: Introduction to Computer Science offered by Harvard on edX"},"content":{"rendered":"<p><em>Review by <a href=\"https:\/\/twitter.com\/reesoliman\">Charlie Soliman<\/a>. Took the <a href=\"https:\/\/www.edx.org\/course\/introduction-computer-science-harvardx-cs50x#.VSLSHGakVD8\">course<\/a>? Write your own review <a href=\"https:\/\/www.classcentral.com\/review\/new\/442\">here<\/a>. <a title=\"Reviews for Introduction to Computer Science by David Malan\" href=\"https:\/\/www.classcentral.com\/mooc\/442\/edx-cs50x-introduction-to-computer-science#course-all-reviews\" target=\"_blank\">Read all reviews.<\/a><\/em><\/p>\n<h2>WHY I DECIDED TO TAKE CS50X<\/h2>\n<blockquote class=\"cc-blockquote cc-blockquote-right cc-blockquote-text\"><p>I don&#8217;t feel guilty for not paying much attention to the description page, which used the word “demanding”<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>I started <a href=\"https:\/\/www.edx.org\/course\/introduction-computer-science-harvardx-cs50x\" target=\"_blank\">Introduction to Computer Science (CS50x)<\/a> on edX contemplating all the theoretical material I was going to receive about how computers work and the software involved in the machine I use everyday to get work done. I skimmed over the course description but did not give it much attention. I was simply searching for a computer science introductory course and nothing more. I had gone through half of Introduction to <a href=\"https:\/\/www.classcentral.com\/mooc\/1341\/edx-6-00-1x-introduction-to-computer-science-and-programming-using-python\">Computer Science and Programming using Python<\/a> on edX and got hooked on the programming language because of its straight-forwardness. I simply gave up that course because I was more interested in coding than I was in the theory. Eventually I realized I needed more information about the machine that was “magically” allowing me to program. In retrospect, I don&#8217;t feel guilty for not paying much attention to the description page, which used the word “demanding”. This would most likely have put me off taking the course, as I might have thought it was heavy on theory – not an appealing prospect.<\/p>\n<p><iframe loading=\"lazy\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/lhlBWlhS7Vg?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen><\/iframe><\/p>\n<p>The first week was a breeze, if not slightly frustrating. It introduces students to the concept of programming using a UI called Scratch, which is a fun but extremely basic way of programming that some hard-core programmers might consider “beneath them”. However, it is a great start considering that no prerequisites are required for this course. Not having any previous programming knowledge or even computer knowledge does not preclude anyone from taking this course. This first week would not set the tone for the remainder of the course as I quickly learned. It was up hill from there and this hill was particularly steep.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-center cc-blockquote-text\"><p>★★★★☆<br \/>\nCS50x is essentially like taking a real, full-length college-level course, complete with lectures, breakout sections, walkthroughs, homework, quizzes, etc&#8230;<br \/>\n&#8211; <a href=\"https:\/\/www.classcentral.com\/mooc\/442\/edx-cs50x-introduction-to-computer-science#review-101\" target=\"_blank\">Review by Mark Mahoney<\/a><span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<h2>WHO IS DAVID MALAN?<\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/David-Malan-Mario-compressor.png\"><img loading=\"lazy\" width=\"1273\" height=\"529\" class=\"alignnone size-full wp-image-60179\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/David-Malan-Mario-compressor.png\" alt=\"David-Malan---Mario-compressor\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/David-Malan-Mario-compressor.png 1273w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/David-Malan-Mario-compressor-300x125.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/David-Malan-Mario-compressor-1024x426.png 1024w\" sizes=\"(max-width: 1273px) 100vw, 1273px\" \/><\/a><\/p>\n<p><a href=\"http:\/\/cs.harvard.edu\/malan\/\" target=\"_blank\">David Malan<\/a> is Gordon McKay Professor of the Practice of Computer Science at Harvard University. His areas of research include (among others) distance learning, collaborative learning and computer-assisted instruction. At the risk of stating a cliché, his approach to teaching is unlike anything I have seen and can easily be labeled as revolutionary. One can detect the joy and effort he puts into each of his lectures.<span class=\"cc-blockquote-border\"> <\/span><\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-center cc-blockquote-text\"><p>At the risk of stating a cliché, his approach to teaching is unlike anything I have seen and can easily be labeled as revolutionary. One can detect the joy and effort he puts into each of his lectures.<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>He has published papers and given talks on using technology to optimize the learning experience in class and through MOOCs. This knowledge certainly comes through in all CS50x material. His TA&#8217;s share the same drive for passing on knowledge in fun-filled ways. I cannot erase from my mind a TA clad in a pumpkin suit for Halloween, which actually proved helpful considering it was the week on data structures, one of the more difficult segments for me. It is not difficult to see why since David start teaching CS50, the class has upwards of 700 students on campus and its online version, CS50x, attracts 400,000 registered students world-wide.<\/p>\n<h2>THE JOURNEY<\/h2>\n<p>I think the most important skills to enter the course with are drive and patience. You will need ample amounts of both to get through the material. It is not an impossible course but does require extra reading and research to hunt for information that will ultimately help complete the problem sets. David&#8217;s approximately 50 minute lectures pave the way for this independent research.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-center cc-blockquote-text\"><p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/programc.jpg\"><img loading=\"lazy\" width=\"260\" height=\"334\" class=\"alignnone size-full wp-image-60127\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/programc.jpg\" alt=\"programc\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/programc.jpg 260w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/programc-234x300.jpg 234w\" sizes=\"(max-width: 260px) 100vw, 260px\" \/><\/a>  <a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/beginc.jpg\"><img loading=\"lazy\" width=\"260\" height=\"321\" class=\"alignnone size-full wp-image-60126\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/beginc.jpg\" alt=\"beginc\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/beginc.jpg 260w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/beginc-243x300.jpg 243w\" sizes=\"(max-width: 260px) 100vw, 260px\" \/><\/a><span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>Students start coding in C in the second week with reading material from two books, both of which will be excellent resources when you get to the problem sets. They are <a href=\"http:\/\/www.amazon.com\/Programming-Absolute-Beginners-Guide-3rd\/dp\/0789751984\/ref=sr_1_fkmr1_1?ie=UTF8&amp;qid=1428451481&amp;sr=8-1-fkmr1\" target=\"_blank\">Absolute Beginner&#8217;s Guide to C<\/a> by Greg Perry and<a href=\"http:\/\/www.amazon.com\/Programming-4th-Edition-Developers-Library\/dp\/0321776410\/ref=pd_sim_b_1?ie=UTF8&amp;refRID=00RZX8XFP4J2B70PRAB6\" target=\"_blank\"> Programming in C<\/a> by Stephen G. Kochan.<\/p>\n<p>The lecture material includes various videos to choose from (or watch all of them). Apart from two weekly lectures, there are a series of short videos (called “Walkthroughs”) each explaining programming functions and using short segments of code for elaboration. In addition there are “Shorts”, 10-15 minute videos of a TA explaining in more detail central concepts discussed in the lecture. TA&#8217;s also provide 1 hour “Sections” that go deeper into some of the more complex material but also providing examples through coding.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-center cc-blockquote-text\"><p>A high moment in the course for me, when I felt I had finally vanquished the dragon, was managing to retrieve “lost” photos from a “damaged” memory card with pics of smiling Harvard students around campus.<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>It must be said that there is a lot of overlap among the videos. David&#8217;s lectures, even though they are a joy to watch, are customized to attract students who might still be considering what they want to do in their careers. I found the Walkthroughs most helpful, as the examples clearly and succinctly explained functions in 5 minutes or less, after which I could transfer the knowledge to the assignments and build on them. The Shorts also provided the requisite information for the more theoretical segments in a similarly succinct but helpful manner.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/CS50x-AMA.jpg\"><img loading=\"lazy\" width=\"960\" height=\"639\" class=\"size-full wp-image-60195\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/CS50x-AMA.jpg\" alt=\"David Malan and his TA's promoting their Reddit AMA\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/CS50x-AMA.jpg 960w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/CS50x-AMA-300x200.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/CS50x-AMA-400x265.jpg 400w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/04\/CS50x-AMA-85x58.jpg 85w\" sizes=\"(max-width: 960px) 100vw, 960px\" \/><\/a><br \/>\n<em>David Malan and his TA&#8217;s promoting their <a href=\"http:\/\/redd.it\/2wbq9f\" target=\"_blank\">Reddit AMA<\/a><\/em><\/p>\n<p>For the assignments, each problem set consisted of a coding exercise and questions relating to how computers process the programs they run. The questions were designed to ensure all information, practical and theoretical, had been properly internalized. The reading from the 2 recommended books also provided ample information and examples. Coding involved designing games and using cryptography (a personal favorite topic). A high moment in the course for me, when I felt I had finally vanquished the dragon, was managing to retrieve “lost” photos from a “damaged” memory card with pics of smiling Harvard students around campus. It certainly sounds like fun, but the coding process can be quite intense.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-left cc-blockquote-text\"><p>I think the most important skills to enter the course with are drive and patience. You will need ample amounts of both to get through the material.<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>As if that wasn&#8217;t enough, the final 2 weeks are reserved for web development where you learn about HTML, CSS, PHP and JavaScript languages. For database management, MySQL was also introduced. These involved much less direct help, as one of the main goals by the end of the course, as David mentions, is to learn how to teach yourself new programming languages. This certainly sets the tone for how to continue learning to program after completing the course. I think the most important skills to enter the course with are drive and patience. You will need ample amounts of both to get through the material.<span class=\"cc-blockquote-border\"> <\/span><\/p>\n<h2>GRADING<\/h2>\n<p>The code is evaluated by an automatic checker that searches for correct syntax and style in the code as well as the correct final answer to make sure it encompasses appropriate programming methods. However, there is no grade attached to the theoretical segment in the grade book, which makes me think it is not checked. I still attempted them to ensure I was getting the maximal benefit. After all, my main aim in joining this course was to gain a good introduction on what goes on inside the computer. Apart from core exercises, there is an ungraded “Hacker edition” that students can optionally attempt. These are much more challenging. Still, I enjoyed hacking my way through the background reading even if I could not complete the code itself.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-center cc-blockquote-text\"><p> Still, I enjoyed hacking my way through the background reading even if I could not complete the code itself.<br \/>\n<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<h2>DISCUSSION BOARD<\/h2>\n<p>As this indeed is the age of social networking, the course has provided various platforms through which students can ask questions, interact and collaborate on projects. Rather than use edX&#8217;s discussion board, there is a selection from Twitter, Facebook, Reddit and Stack Exchange for interaction. I found that Twitter was more of a platform through which students say hello or check up on issues that can be squeezed into 140 character. David promptly hello&#8217;d back and offered responses to those tweets with questions. Reddit and Stack Exchange were certainly more helpful when I had programming or logistic problems but they are offered more as platforms to get help from other CS50 students rather than TA&#8217;s. Students are also allowed to collaborate on the assignments and projects in the discussion board. I found the general Stack Exchange community most helpful, with  responses already available from previous questioners with the identical or similar issue. Beware of those posting CS50 problem set responses. They spoil all the fun in finding the answer yourself.<\/p>\n<h2>CONCLUSION<\/h2>\n<p>The learning curve was quite steep for me so I was grateful the course was open for a whole year. I had to start from Scratch quite literally (pun intended). I cannot fathom how Harvard students are completing each problem set in one week and the entire course in a single semester. I was taking only one other edX course but needed up to 40 hours to complete each problem set. This improved over the course of the year but I could not complete any of the courses in the week allocated and some coding exercises would have me pulling my hair out. Nevertheless, the sense of accomplishment with the completion of each problem set was exhilarating beyond measure.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-right cc-blockquote-text\"><p>Nevertheless, the sense of accomplishment with the completion of each problem set was exhilarating beyond measure.<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>Probably the most encouraging piece of information David offers in the first lecture is that about 70% of students have no previous programming skills and that your measure of progress at the end of the course is not by comparing yourself to other students but to compare your knowledge to that you yourself had at the start. I consider myself quite fortunate to have started out searching for a course on how computers work and ended up with so much more. I have learned 3 programming languages, 2 markup languages and 1 database and started a programming projects portfolio.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-center cc-blockquote-text\">\n<p style=\"text-align: left;\">I consider myself quite fortunate to have started out searching for a course on how computers work and ended up with so much more.<span class=\"cc-blockquote-border\"> <\/span><\/p>\n<\/blockquote>\n<h2>ROAD AHEAD<\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/mooc\/1341\/edx-6-00-1x-introduction-to-computer-science-and-programming-using-python\">Introduction to Computer Science and Programming using Python<\/a><br \/>\n<a href=\"https:\/\/www.classcentral.com\/mooc\/1779\/edx-6-00-2x-introduction-to-computational-thinking-and-data-science\"> Introduction to Computational Thinking and Data Science<\/a><br \/>\nTo delve into object-oriented programming: <a href=\"https:\/\/www.classcentral.com\/mooc\/831\/udacity-introduction-to-programming-in-java\">Introduction to Programming in Java<\/a><\/p>\n<p>[review_widget]<\/p>\n<p><i><b>Editors Note<\/b>: Review by <a href=\"https:\/\/twitter.com\/reesoliman\"><em>Charlie Soliman<\/em><\/a>. <\/i><em>Charlie is a MOOC enthusiast by day, coder by night. She has an MSc. in Molecular Cell Biology but computer programming has opened her eyes to the world of software design and she now enjoys nothing more than coming up with new ideas and making them come to life through code.<\/em><\/p>\n<p>Class Central is looking for reviewers and regular contributors. If you’ve ever finished a MOOC and want to write a critique to help future students considering taking that course, we want to hear from you. Drop us a <a href=\"mailto:contact@classcentral.com\">mail<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Review of HarvardX&#8217;s Introduction to Computer Science CS50 on edX as made famous by David Malan.<\/p>\n","protected":false},"author":13,"featured_media":60179,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[178],"tags":[51,275],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Course Review: Introduction to Computer Science offered by Harvard on edX — Class Central<\/title>\n<meta name=\"description\" content=\"Review of HarvardX&#039;s Introduction to Computer Science CS50 on edX as made famous by David Malan.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Course Review: Introduction to Computer Science offered by Harvard on edX\" \/>\n<meta property=\"og:description\" content=\"Review of HarvardX&#039;s Introduction to Computer Science CS50 on edX as made famous by David Malan.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2015-04-09T15:01:56+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-04-10T19:46:20+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/11\/the-report-meta.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Charlie Soliman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/\",\"name\":\"Course Review: Introduction to Computer Science offered by Harvard on edX — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#primaryimage\"},\"datePublished\":\"2015-04-09T15:01:56+00:00\",\"dateModified\":\"2015-04-10T19:46:20+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/dbb566109b1b169cee07a659846dd5ed\"},\"description\":\"Review of HarvardX's Introduction to Computer Science CS50 on edX as made famous by David Malan.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Course Review: Introduction to Computer Science offered by Harvard on edX\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/dbb566109b1b169cee07a659846dd5ed\",\"name\":\"Charlie Soliman\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/e7654ff04e6f3d701949da50ea77f3e2?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/e7654ff04e6f3d701949da50ea77f3e2?s=96&d=mm&r=g\",\"caption\":\"Charlie Soliman\"},\"url\":\"https:\/\/www.classcentral.com\/report\/author\/charlie-soliman\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Course Review: Introduction to Computer Science offered by Harvard on edX — Class Central","description":"Review of HarvardX's Introduction to Computer Science CS50 on edX as made famous by David Malan.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/","og_locale":"en_US","og_type":"article","og_title":"Course Review: Introduction to Computer Science offered by Harvard on edX","og_description":"Review of HarvardX's Introduction to Computer Science CS50 on edX as made famous by David Malan.","og_url":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2015-04-09T15:01:56+00:00","article_modified_time":"2015-04-10T19:46:20+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/11\/the-report-meta.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Charlie Soliman","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#webpage","url":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/","name":"Course Review: Introduction to Computer Science offered by Harvard on edX — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#primaryimage"},"datePublished":"2015-04-09T15:01:56+00:00","dateModified":"2015-04-10T19:46:20+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/dbb566109b1b169cee07a659846dd5ed"},"description":"Review of HarvardX's Introduction to Computer Science CS50 on edX as made famous by David Malan.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/review-david-malan-cs50-introduction-to-cs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"Course Review: Introduction to Computer Science offered by Harvard on edX"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/dbb566109b1b169cee07a659846dd5ed","name":"Charlie Soliman","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/e7654ff04e6f3d701949da50ea77f3e2?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/e7654ff04e6f3d701949da50ea77f3e2?s=96&d=mm&r=g","caption":"Charlie Soliman"},"url":"https:\/\/www.classcentral.com\/report\/author\/charlie-soliman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60118"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=60118"}],"version-history":[{"count":44,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60118\/revisions"}],"predecessor-version":[{"id":60188,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60118\/revisions\/60188"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/60179"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=60118"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=60118"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=60118"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}