{"id":60953,"date":"2015-06-22T21:48:17","date_gmt":"2015-06-23T04:48:17","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=60953"},"modified":"2018-10-03T05:43:39","modified_gmt":"2018-10-03T12:43:39","slug":"george-siemens-preparing-for-digital-university","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/","title":{"rendered":"Report Review of Siemen’s ‘Preparing for the Digital University’"},"content":{"rendered":"<p>In 2013, the Bill and Melinda Gates Foundation funded the <a href=\"https:\/\/web.archive.org\/web\/20150322152729\/http:\/\/www.moocresearch.com\/\" target=\"_blank\">MOOC Research Initiative (MRI)<\/a> with an $835,000 grant to be administered by Athabasca University, to conduct further research on MOOCs. In addition to sponsoring primary research, the MRI produced a series of reports attempting to summarize findings from existing literature reviews. These reports were compiled into a 230-page collection published in February of 2013 entitled entitled <a href=\"http:\/\/linkresearchlab.org\/PreparingDigitalUniversity.pdf\" target=\"_blank\">‘Preparing for the Digital University: A review of the history and current state of distance, blended and online learning’<\/a>. It was authored by <a href=\"https:\/\/twitter.com\/gsiemens\" target=\"_blank\">George Siemens<\/a> (University of Texas at Arlington), Dragan Gasevic (University of Edinburgh), and Shane Dawson (University of South Australia). The purpose of the reports is to <em>“introduce academics, administrators, and students to the rich history of technology in education…”<\/em> (p. 7). It sounds like it has important things to say to a wide audience involved in MOOCs and online education. Are you intrigued but feel less than eager to dive into a 230-page report? Or do you want a handy summary of some of the main findings? That&#8217;s why Class Central has produced  this summary&#8230;but the reports are quite readable, so if these findings are of interest, please do dive into the <a href=\"http:\/\/linkresearchlab.org\/PreparingDigitalUniversity.pdf\" target=\"_blank\">reports<\/a>, and the numerous sources that they draw upon.<\/p>\n<h2><strong>Format and Methods of the Report<\/strong><\/h2>\n<p>The 230-page document was released under a Creative Commons 4.0 BY-SA license, and consists of six separate reports, each providing an overview of a topic area:<\/p>\n<p style=\"padding-left: 90px;\">• <strong>‘The History and State of Distance Education’<\/strong> (Vitomir Kovanovic, Srecko Joksimovic, Oleksandra Skrypnyk, Dragan Gasevic, Shane Dawson, George Siemens)<\/p>\n<p style=\"padding-left: 90px;\">• <strong>‘The History and State of Blended Learning’ <\/strong>(Oleksandra Skrypnyk, Srecko Joksimovic, Vitomir Kovanovic, Shane Dawson, Dragan Gasevic, George Siemens)<\/p>\n<p style=\"padding-left: 90px;\">• <strong>‘The History and State of Online Learning’<\/strong> (Srecko Joksimovic, Vitomir Kovanovic, Oleksandra Skrypnyk, Dragan Gasevic, Shane Dawson, George Siemens)<\/p>\n<p style=\"padding-left: 90px;\">• <strong>‘The History and State of Credentialing and Assessment’<\/strong> (Charles Lang, George Siemens, Dragan Gasevic, Shane Dawson)<\/p>\n<p style=\"padding-left: 90px;\">•<strong> ‘Where is Research on Massive Open Online Courses Headed?’<\/strong> (Dragan Gasevic, Vitomir Kovanovic, Srecko Joksimovic, George Siemens)<\/p>\n<p style=\"padding-left: 90px;\">•<strong> ‘Future Technology Infrastructures for Learning’<\/strong> (George Siemens, Dragan Gasevic, Shane Dawson)<\/p>\n<p>Each of these reports attempts to briefly summarize the topic, and point out the major conclusions from the research. As there is a large amount of research in these areas, the reports draw upon secondary or meta-studies (that is, studies of studies) to try to bring out consensus results&#8211;thus, the reports are tertiary studies. This allows them to be relatively brief, and though the conclusions are somewhat modest, the level of support for them is strong, being stable across numerous research contexts. We&#8217;ll note there has been some <a href=\"http:\/\/halfanhour.blogspot.ca\/2015\/05\/research-and-evidence.html\" target=\"_blank\">lively criticism<\/a> of the report from Stephen Downes (and a somewhat surprisingly <a href=\"http:\/\/www.elearnspace.org\/blog\/2015\/05\/03\/linearity_downes\/\" target=\"_blank\">personal exchange<\/a> between him and George Siemens (the two of them being the originators of the &#8220;first&#8221; MOOC).<\/p>\n<p>A common methodology was followed to draw out the research for the first three reports on distance, online, and blended learning: a keyword search of peer reviewed papers, conference papers, doctoral dissertations and government reports, via several databases as well as Google Scholar, plus a manual review of 11 distance learning-related journals. 339 studies were found, of which 37 were drawn upon for the distance education report, 32 for the online learning report, and 20 for the blended learning report.<\/p>\n<p>Below is a framework that was introduced to list the main influential factors in distance\/online learning:<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Siemens-Report-Online-learning-diagram.png\"><img class=\"alignnone wp-image-61000 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Siemens-Report-Online-learning-diagram.png\" alt=\"Siemens Report Online learning diagram\" width=\"100%\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Siemens-Report-Online-learning-diagram.png 641w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Siemens-Report-Online-learning-diagram-279x300.png 279w\" sizes=\"(max-width: 641px) 100vw, 641px\" \/><\/a><\/p>\n<h6>(Image source: Preparing for the Digital University, Siemens, G., Gasevic, D., Dawson, S., Creative Commons Attribution-ShareAlike 4.0 International License. p. 120).<\/h6>\n<p>Below, in each section, we&#8217;ll describe the methodology of the report and highlight some of the primary findings, as they appear to us.<\/p>\n<h2><strong>Report Review: The History and State of Online Learning<\/strong><\/h2>\n<p>For this report, 32 secondary or meta-studies were reviewed, each covering a dozen or several dozen primary studies in both higher education and adult learning contexts. Some of the primary findings are below:<\/p>\n<p style=\"padding-left: 120px;\">• Online learning has been shown to be <strong>at least as effective<\/strong> as face-to-face learning, across multiple reviews of hundreds of independent studies<\/p>\n<p style=\"padding-left: 120px;\">• The pedagogy used in online instruction has a large impact on learning, but <strong>the particular technology used<\/strong> has little impact<\/p>\n<p style=\"padding-left: 150px;\">· However, visually engaging content is thought to be helpful<\/p>\n<p style=\"padding-left: 120px;\">• A key pedagogical design element is to <strong>facilitate interaction<\/strong>, where student interact with course content, instructors, and peers. Interestingly, among these, student-student interaction and collaborative learning is most strongly associated with academic performance<\/p>\n<p style=\"padding-left: 150px;\">· The most common channel for peer interaction was asynchronous discussion forums, and these were more beneficial when interaction within them was structured, moderated, and had clear guidelines<\/p>\n<p style=\"padding-left: 150px;\">· Another important element is for students to have <strong>individualized feedback<\/strong>&#8211;much of this may come from the interaction described above. Despite efforts to provide some feedback via auto-graded quizzes, there is much room for improvement here, as the real value is in addressing the learner’s thought processes, and quiz explanations (when used) only partially address this.<\/p>\n<p style=\"padding-left: 150px;\">· There were benefits to prompting students with <strong>self-reflection<\/strong> and <strong>self-assessment<\/strong> exercises<\/p>\n<p style=\"padding-left: 120px;\">• From a student perspective, they tended to value<em> “well-designed, frequently updated courses that incorporate extrinsic motivating factors, with tasks\/examples immediately relevant to their practice, a reasonable level of control and flexibility (primarily in terms of deadlines), support to collaborate with their peers, and a high level of instructor involvement in providing summative and timely feedback”<\/em> <em>(p. 115)<\/em><\/p>\n<p style=\"padding-left: 120px;\">• From an instructor perspective, to supply these beneficial pedagogical elements requires a greater amount of effort than designing a face-to-face classroom experience. A helpful trend here is that often small instructional teams are formed to produce and run online courses, however, support at the institutional level is often still lacking<\/p>\n<p style=\"padding-left: 150px;\">· The biggest gaps are insufficient technical infrastructure and formally established policies and a shared vision for supporting online courses<\/p>\n<h2><strong>Report Review: The History and State of Distance Education Report<\/strong><\/h2>\n<p>Distance education has a long history and includes methods that pre-dated the modern internet (for example with mail correspondence or teleconference-based courses). Thus there is a greater amount of research here, and most of the 37 secondary studies were journal articles that covered dozens or hundreds of primary studies. Many of the findings are similar to the findings in the online learning report (re: effectiveness, pedagogical elements, success factors, etc.). Perhaps the fact that the results are so similar to the research on online learning (remember, per the methodology, these were separate studies) is <strong>additional support<\/strong> for the notion that the technological media through which we learn has <strong>much less of an impact<\/strong> than the pedagogy, and that the primary effect of the technology has been on <strong>accessibility<\/strong>. There were a few findings that were specific to distance education:<\/p>\n<p style=\"padding-left: 120px;\">• Students showed slightly <strong>higher satisfaction<\/strong> with distance education vs. face-to-face education—distance learning students particularly valued the flexible pace and personalized elements of the learning environment<\/p>\n<p style=\"padding-left: 120px;\">• Overall effectiveness of distance education (again, similar to online learning, was just as effective as face-to-face), has been <strong>increasing over time<\/strong><\/p>\n<p style=\"padding-left: 120px;\">• Among learner segments, effectiveness of distance learning was <strong>higher for professional learners<\/strong> than college students<\/p>\n<p style=\"padding-left: 120px;\">• The use of<strong> learner-produced<\/strong> (i.e. user-generated) content was seen an increasing and promising trend<\/p>\n<h2><strong>Report Review: The History and State of Blended Learning Report<\/strong><\/h2>\n<p>Blended learning is used to describe the mixing of both face-to-face and online instructional elements, and is becoming increasingly common, especially in the K12 space (think of Khan Academy), but also in the higher education space with MOOCs. This report is based on a review of 20 meta-studies. There were surprisingly <strong>few conclusions<\/strong> that could be drawn, primarily because of the <strong>wide diversity<\/strong> of blended learning environments and heterogeneity in the way it was studied. Some conclusions were as follows:<\/p>\n<p style=\"padding-left: 120px;\">• Results point to blended learning leading to superior learning outcomes compared to either 100% face-to-face or online learning; however, confidence in this conclusion is somewhat tempered due to the different definitions, measures, and approaches of the underlying studies that were drawn upon<\/p>\n<p style=\"padding-left: 120px;\">• In terms of instructional practices, <strong>teacher-directed<\/strong> instruction and <strong>collaborative<\/strong> interactive learning were both superior to self-paced independent learning on objective learning outcomes. It is perhaps no surprise that this would be the case when measured against pre-established learning outcomes, but it was interesting to see collaborative learning do so well<\/p>\n<p style=\"padding-left: 120px;\">• The major point the report makes is that most instructors approach blended learning as combining two separate components (online and face-to-face), without exploring the potential synergies of better <strong>connecting them together<\/strong><\/p>\n<p style=\"padding-left: 150px;\">· From a research standpoint, they note that most of the theory and design guidance comes from the online learning literature, and that unique opportunities brought about by blended learning have not been fully studied—thus, accounting for the dearth of conclusions in this report<\/p>\n<h2><strong>Report Review: The History and State of Credentialing and Assessment<\/strong><\/h2>\n<p>This short report (p.133-159) notes that credentialing is undergoing a shift both inside and outside the university. It presents a framework of looking at credentials across two dimensions: as having a <strong>fixed vs. flexible<\/strong> timeframe, and having assessment based on <strong>proficiency<\/strong> (i.e. knowledge) vs. <strong>competency<\/strong> (i.e. skill). Thus, the standard university credit-hour would be fixed-time, proficiency-based. The<a href=\"http:\/\/www.phoenix.edu\/\" target=\"_blank\"> University of Phoenix<\/a> would be an example of flexible-time, proficiency-based. The report points to the multi-course certification programs of MOOC providers, specifically Udacity’s Nanodegrees, as examples of fixed or flexible competency-based programs. It is unclear how helpful this framework is, but it may be a fine initial way to organize the different credentialing schemes that are emerging.<\/p>\n<p>The report also mentions the use of <strong>badges<\/strong>, with its roots in gamification, and the useful open-source platform <a href=\"http:\/\/openbadges.org\/\" target=\"_blank\">Mozilla Open Badges<\/a>. It also mentions peer-based <strong>reputation credentials<\/strong>, such as those which accrue in platforms like Stack Overflow (you could add others, like reddit or Quora). The point is that there is the potential for drastically new options we’ll have available to define credentials&#8230;but of course the problem will be how to synthesize the right data into meaningful signals.<\/p>\n<h2><strong>Report Review: Where is Research on Massive Open Online Courses Headed?<\/strong><\/h2>\n<p>This report followed a unique approach to collecting sources. It consisted of analyzing the 266 papers submitted for the MOOC Research Initiative call for papers (only 28 grants were funded). These 266 papers, as well as the citations made within them, comprised the universe of sources that were then analyzed using network analysis techniques to determine key research themes. Below are some of the results:<\/p>\n<p style=\"padding-left: 120px;\">• The main theme that cut across studies was that of <strong>engagement<\/strong> in MOOCs: how to measure it, how it relates to learners intentions, and understanding factors that affect it<\/p>\n<p style=\"padding-left: 120px;\">• Another important theme was <strong>social learning<\/strong>—fitting as more than half of the authors were from the discipline of education, where there are deep theoretical roots on the role of social interaction on learning<\/p>\n<p style=\"padding-left: 120px;\">• There should be an increased research focus on enabling skills among learners is important, as much of online learning requires learners to be <strong>self-regulated<\/strong>: metacognitive skills, learning strategies, and attitudes<\/p>\n<p style=\"padding-left: 120px;\">• Given the worldwide spread of MOOCs, there should also be greater geographic diversity of researchers and studies, as most studies are currently drawn from a North American setting<\/p>\n<h2><strong>Report Review: Future Technology Infrastructures for Learning<\/strong><\/h2>\n<p>This report is an overview of learning technologies. It also describes four generations of technology development in the following way:<\/p>\n<p style=\"padding-left: 120px;\"><strong>Generation 1<\/strong> : basic echnology use, e.g. computer-based training<br \/>\n<strong>Generation 2<\/strong>: learning management (LMS) and content management (CMS) systems<br \/>\n<strong>Generation 3<\/strong>: diverse, fragmented systems, e.g social media, e-portfolios, MOOC providers, etc.<br \/>\n<strong>Generation 4<\/strong>: distributed technologies, adaptive learning, distributed infrastructures, and competency models<\/p>\n<p>The report notes that we are currently in the midst of developing Generation 4 systems. The report goes on to evaluate several different technologies, and analyzes them along a spectrum of focus from the individual to a larger collective, across four characteristics: control, ownership, integration, and structure. As with the credentialing framework described earlier, it is unclear how this framework can be helpful, but perhaps some will find it a useful tool.<\/p>\n<h2><strong>Overall Comments<\/strong><\/h2>\n<p>A few final thoughts on this 230-page report. The main takeaway that we think is important is for people to understand and be exposed to the history of research that has been done on online learning, that it has roots in distance education, and that there is enough research that studies or studies, and studies of studies of studies have been done (as well as this summary of studies of studies of studies). Online education is not new and we know more than most realize. Some of the conclusions may be obvious to some involved in online learning projects: that online learning can be as good as (or better) than face-to-face learning, that interaction is an important element in learning. Some may be a surprise, such as the fact that the particular technology used has relatively little impact on learning outcomes, while pedagogical approaches have large ones. This can be a healthy check on the tendency to blindly follow <a href=\"http:\/\/hackeducation.com\/2013\/03\/26\/ed-tech-solutionism-morozov\/\" target=\"_blank\">technology-solutionism<\/a> (from a practitioner perspective, see <a href=\"https:\/\/www.classcentral.com\/report\/why-my-mooc-is-not-built-on-video\/\" target=\"_blank\">Why My MOOC is Not Based on Video<\/a>).<\/p>\n<p>On the &#8220;room for improvement&#8221; side of the ledger, while these reports collect a nice set of meta-studies, it would have been nice to have walked through some of the key ones in more depth, or provided a summary of each, as a guide to the reader on where to dive in further. The reports beyond the distance\/blended\/online education ones were fairly lightweight, with few significant conclusions. Also, the nature of tertiary studies means that though conclusions may be strong, they tend to be fairly general because they are drawn from so many different research contexts&#8211;the trade-off for high confidence in a survey of a body of work is decreased specificity. Still, it is good to capture and synthesize the well-known findings. Let&#8217;s not forget that innovation and experimentation in something as important as education should be done with awareness of the rich research and diversity of actual practices that that exist.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Class Central summarizes the main findings from the MOOC Research Initiative (MRI) Report: Preparing for the Digital University.<\/p>\n","protected":false},"author":3,"featured_media":61019,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[641,639],"tags":[432],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Report Review of Siemen’s ‘Preparing for the Digital University’ — Class Central<\/title>\n<meta name=\"description\" content=\"Class Central summarizes the main findings from the MOOC Research Initiative (MRI) Report: Preparing for the Digital University.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Report Review of Siemen’s ‘Preparing for the Digital University’\" \/>\n<meta property=\"og:description\" content=\"Class Central summarizes the main findings from the MOOC Research Initiative (MRI) Report: Preparing for the Digital University.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2015-06-23T04:48:17+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-10-03T12:43:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/11\/the-report-meta.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Charlie Chung\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/\",\"name\":\"Report Review of Siemen’s ‘Preparing for the Digital University’ — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#primaryimage\"},\"datePublished\":\"2015-06-23T04:48:17+00:00\",\"dateModified\":\"2018-10-03T12:43:39+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/3d7f835195b15646a50778cf7c81d159\"},\"description\":\"Class Central summarizes the main findings from the MOOC Research Initiative (MRI) Report: Preparing for the Digital University.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Report Review of Siemen’s ‘Preparing for the Digital University’\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/3d7f835195b15646a50778cf7c81d159\",\"name\":\"Charlie Chung\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/895499fc7b283d0d4f3d459da24fdb76?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/895499fc7b283d0d4f3d459da24fdb76?s=96&d=mm&r=g\",\"caption\":\"Charlie Chung\"},\"url\":\"https:\/\/www.classcentral.com\/report\/author\/charlie\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Report Review of Siemen’s ‘Preparing for the Digital University’ — Class Central","description":"Class Central summarizes the main findings from the MOOC Research Initiative (MRI) Report: Preparing for the Digital University.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/","og_locale":"en_US","og_type":"article","og_title":"Report Review of Siemen’s ‘Preparing for the Digital University’","og_description":"Class Central summarizes the main findings from the MOOC Research Initiative (MRI) Report: Preparing for the Digital University.","og_url":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2015-06-23T04:48:17+00:00","article_modified_time":"2018-10-03T12:43:39+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/11\/the-report-meta.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Charlie Chung","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#webpage","url":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/","name":"Report Review of Siemen’s ‘Preparing for the Digital University’ — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#primaryimage"},"datePublished":"2015-06-23T04:48:17+00:00","dateModified":"2018-10-03T12:43:39+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/3d7f835195b15646a50778cf7c81d159"},"description":"Class Central summarizes the main findings from the MOOC Research Initiative (MRI) Report: Preparing for the Digital University.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/george-siemens-preparing-for-digital-university\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"Report Review of Siemen’s ‘Preparing for the Digital University’"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/3d7f835195b15646a50778cf7c81d159","name":"Charlie Chung","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/895499fc7b283d0d4f3d459da24fdb76?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/895499fc7b283d0d4f3d459da24fdb76?s=96&d=mm&r=g","caption":"Charlie Chung"},"url":"https:\/\/www.classcentral.com\/report\/author\/charlie\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60953"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=60953"}],"version-history":[{"count":12,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60953\/revisions"}],"predecessor-version":[{"id":61036,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60953\/revisions\/61036"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/61019"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=60953"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=60953"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=60953"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}