{"id":74011,"date":"2021-01-17T20:55:22","date_gmt":"2021-01-18T04:55:22","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=74011"},"modified":"2021-01-17T20:57:15","modified_gmt":"2021-01-18T04:57:15","slug":"most-popular-february-2021","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/","title":{"rendered":"40 Most Popular Online Courses Starting in February 2021"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-68727\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\" alt=\"\" width=\"1025\" height=\"513\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png 1025w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular-300x150.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular-768x384.png 768w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular-1024x512.png 1024w\" sizes=\"(max-width: 1025px) 100vw, 1025px\" \/><\/p>\n<p>Here are the forty most popular new <a href=\"https:\/\/www.classcentral.com\/help\/moocs\/\">Massive Open Online Courses<\/a> (MOOCs) starting in February 2021, based on Class Central learners’ activity.<\/p>\n<p>You can find the entire catalog of  30,000 online courses offered by ~1000 universities around the world, on <a href=\"https:\/\/www.classcentral.com\/subjects\">Class Central’s subject page<\/a>.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-tourism-and-climate-change-19159\"><b>Tourism and Climate Change<\/b><\/a><br \/>\n<i>Wageningen University via edX<\/i><span lang=\"EN-GB\">Join this online course and understand how tourism and climate change are inextricably connected. Strategically position yourself, and your organisation, and address the causes and challenges of climate change that we are facing now and in the future.<\/span><\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/critical-thinking-skills-for-professionals-25325\"><b>Critical Thinking Skills for the Professional<\/b><\/a><br \/>\n<i>University of California, Davis via Coursera<\/i><br \/>\nBy the end of this course you will have learned and memorized a practical model to solve problems on your own and with others. These 7 critical steps will ensure that you have looked at a problem from every angle and considered multiple solutions. In fact, this dynamic and holistic approach will help you solve problems once and for all!<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/emotional-and-social-intelligence-25326\"><b>Emotional and Social Intelligence<\/b><\/a><br \/>\n<i>University of California, Davis via Coursera<\/i><br \/>\nIn this course, we will explain the value of emotional and social intelligence for professional success. We&#8217;ll assess current emotional and social intelligence skills and you will discover the Foundational 4 Quadrants of Emotional and Social Intelligence (ESI) to understand, use and manage emotions.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-thermal-comfort-in-buildings-19387\"><b>Thermal Comfort in Buildings<\/b><\/a><br \/>\n<i>Delft University of Technology via edX<br \/>\n<\/i>Learn how to realize thermally comfortable and healthy buildings and how energy technologies impact comfort.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-business-success-in-the-screen-industries-how-to-pitch-your-script-and-self-produce-21287\"><b>Business success in the screen industries: how to pitch your script and self-produce<\/b><\/a><br \/>\n<i>University of Cambridge via edX<br \/>\n<\/i>Learn how to network in the creative industries, how pitch your film to a producer, and how to hold your own in a TV writers’ room. Acquire the basic skills for setting up your own production company and learn how to transform creative ideas into work of commercial value. This course will broaden your understanding of how to maintain a career successfully as a professional screenwriter, as well as offer you insights in how to maximise and enjoy the processes of your personal creativity.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/designing-learning-innovation-24357\"><b>Designing Learning Innovation<\/b><\/a><br \/>\n<i>Politecnico di Milano via Coursera<\/i><br \/>\nIn the course you will find video lessons and infographic articulated as in the book. You will also encounter different types of activities which will contribute to make your experience richer and more complete.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-nutrition-communication-for-health-professionals-key-concepts-21027\"><b>Nutrition Communication for Health Professionals: Key concepts<\/b><\/a><br \/>\n<i>University of Newcastle via edX<br \/>\n<\/i>Learn about the role of nutrition communication in the prevention and management of type 2 diabetes and cardiovascular disease. Find out how to identify diet-related health risk, barriers to change, and how to start healthy conversations to assist others in achieving nutrition related health goals.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/statistics-computation-and-applications-22414\"><b>Data Analysis: Statistical Modeling and Computation in Applications<\/b><\/a><br \/>\n<i>Massachusetts Institute of Technology via edX<br \/>\n<\/i>A hands-on introduction to the interplay between statistics and computation for the analysis of real data. &#8212; <em>Part of the MITx MicroMasters program in Statistics and Data Science.<\/em><\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-asylum-and-refugee-law-21026\"><b>Asylum and refugee law<\/b><\/a><br \/>\n<i>Université catholique de Louvain via edX<br \/>\n<\/i>What is asylum? What is the principle of non-refoulement? Who should be recognized and protected as a refugee? These notions are complex. Learn to understand and apply them!<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/art-comes-first-exploring-the-intersection-of-sty-24321\"><b>Art Comes First: Exploring the Intersection of Style and Identity<\/b><\/a><br \/>\n<i>Hopenclass via FutureLearn<\/i><br \/>\nExercise creative brand development skills and learn how to build a brand with an authentic identity and style.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/diversity-and-inclusion-for-hr-professionals-24354\"><b>Diversity and Inclusion for HR Professionals<\/b><\/a><br \/>\n<i>University of California, Irvine via Coursera<\/i><br \/>\nWelcome to Diversity &amp; Inclusion for HR Professionals. In this course we will review the changing landscape of the workplace and discuss the current change drivers that make Diversity and Inclusion an important focus for your organization.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/cloud-application-security-25334\"><b>Cloud Application Security<\/b><\/a><br \/>\n<i>University of Minnesota via Coursera<\/i><br \/>\nAfter completing the course, the student should be able to do the following:<br \/>\n● List and describe the OWASP Top 10 vulnerabilities.<br \/>\n● Identify methods to provide cloud security assurance as part of the development life cycle, e.g. in a continuous delivery environment.<br \/>\n● List and describe the different types of virtualization or sandboxing used to protect cloud applications at either the server or client.<br \/>\n● Describe the application of authentication factors and federated identity solutions in cloud client and server authentication.<br \/>\n● Given a cloud application, explain where and how the necessary crypto keys, passwords, and other security secrets should be stored and distributed.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/intro-augmented-virtual-mixed-extended-reality-te-23274\"><b>Intro to AR\/VR\/MR\/XR: Technologies, Applications &amp; Issues<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nThis first course in the XR for Everybody specialization creates a foundational understanding of the differences between AR, VR, MR, and XR. The course provides learners with a broad overview of the rapidly evolving XR space and the tools to characterize future XR developments and assess their potential and limitations.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/managing-emotions-uncertainty-stress-22856\"><b>Managing Emotions in Times of Uncertainty &amp; Stress<\/b><\/a><br \/>\n<i>Yale University via Coursera<\/i><br \/>\nDeveloped by the Yale Center for Emotional Intelligence, Managing Emotions in Times of Uncertainty &amp; Stress will provide participants with the knowledge, skills, and strategies to understand and manage their emotions and those of their students. The 10-hour online course is designed for school staff, including teachers, paraprofessionals, counselors, principals, and non-teaching staff in preK-12 schools.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/consciousness-23316\"><b>Application of Digital Health Interventions<\/b><\/a><br \/>\n<i>Tapei Medical University via FutureLearn<\/i><br \/>\nResearch on digital heath interventions in mental health<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/algebra-and-algorithms-23288\"><b>Algebra &amp; Algorithms<\/b><\/a><br \/>\n<i>Moscow Institute of Physics and Technology via Coursera<\/i><br \/>\nAlgebra is one of the definitive and oldest branches of mathematics, and design of computer algorithms is one of the youngest. Despite this generation gap, the two disciplines beautifully interweave.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/value-based-care-organizational-competencies-24345\"><b>Value-Based Care: Organizational Competencies<\/b><\/a><br \/>\n<i>University of Houston via Coursera<\/i><br \/>\nThis course is designed to introduce you to the changes an organization will need to make to succeed in value-based care and payment. You will also explore strategies to address some of the challenges in the journey to value-based care. In the summative assignment, you will demonstrate your knowledge by envisioning that you have been invited to speak as part of a roundtable discussion on the challenges of transitioning to value-based care and payment.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/mobile-marketing-optimization-tactics-and-analyti-25498\"><b>Mobile Marketing, Optimization Tactics, and Analytics<\/b><\/a><br \/>\n<i>University of California, Irvine via Coursera<\/i><br \/>\nThe remaining modules will provide you with the knowledge needed to increase sales, boost engagement, and interpret website analytics. This course will culminate in a peer-reviewed activity, in which you will have the opportunity to apply all the skills you have learned throughout the previous courses in this series.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/excel-data-visualization-23167\"><b>Data Visualization in Excel<\/b><\/a><br \/>\n<i>Macquarie University via Coursera<\/i><br \/>\nOver five weeks we will explore Excel&#8217;s rich selection of visualization tools using practical case studies as seen through the eyes of Rohan, an environmental analyst. Rohan is required to produce visualizations that will show trends, forecasts, breakdowns and comparisons for a large variety of environmental data sets.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/natures-sandbox-i-the-history-of-ancient-environm-22675\"><b>The History of Ancient Environments, Climate, and Life<\/b><\/a><br \/>\n<i>Massachusetts Institute of Technology via edX<br \/>\n<\/i>A survey Earth&#8217;s early history of life and environments through a combination of classroom lecture and virtual field trips to Northern Minnesota, Svalbard, Norway, and the Death Valley area. At these key sites, students explore the interactions between Earth&#8217;s early environments and ancient life.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/agriculture-and-nutrition-23159\"><b>Agriculture and Nutrition<\/b><\/a><br \/>\n<i>Tapei Medical University via FutureLearn<\/i><br \/>\nThe benefits of rice bran for preventing chronic diseases; the relationships of the mammary gland, and immune in cow<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/openhpi-cyberthreats-malware-27214\"><b>Cyberthreats: Malware<\/b><\/a><br \/>\n<i> via openHPI<br \/>\n<\/i>In this course, Prof. Meinel and the teaching team aim to raise awareness for malware cyber threats. Botnets, worms, trojans, and spyware are the most common types of malware. But with every newly discovered malware, there is already a new, more sophisticated one on the market. Antivirus programs lag behind the rapid development of new malware.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/alternative-mobility-narratives-24344\"><b>Alternative Mobility Narratives<\/b><\/a><br \/>\n<i>University of Amsterdam via Coursera<\/i><br \/>\nReady to imagine a radically different mobility future? This course is about the stories that we tell ourselves about why and how we move. By critically examining our current narratives, we help you think about mobility in a new way.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/technology-of-modern-composite-materials-with-car-25332\"><b>Technology of modern composite materials with carbon fillers<\/b><\/a><br \/>\n<i>St. Petersburg State Polytechnic University via Coursera<\/i><br \/>\nThe course will help train specialists in the field of processing of hydrocarbon raw materials, creating effective chemical means for protecting agricultural plants and animals, new materials, including advanced alloys (superalloys), advanced polymers, advanced composite materials, advanced ceramic materials, metal powders and metal-powder compositions, and metamaterials.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-quantum-computing-ii-hardware-21185\"><b>Quantum Computing II: Hardware<\/b><\/a><br \/>\n<i>Purdue University via edX<br \/>\n<\/i>Learn how present-day material platforms are built to perform quantum information processing tasks.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/applications-development-microservices-serverless-25453\"><b>Application Development using Microservices and Serverless <\/b><\/a><br \/>\n<i>IBM via Coursera<\/i><br \/>\nAre you a developer ready to explore serverless application development? This intermediate-level course is for you!<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-international-nuclear-law-23739\"><b>Introduction to International Nuclear Law<\/b><\/a><br \/>\n<i>National Research Nuclear University MEPhI via Coursera<\/i><br \/>\nSo, what is international nuclear law? What aspects of international cooperation exist in this direction? You will learn about this in our course.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-quantum-computing-for-everyone-2-25375\"><b>Introduction to Quantum Computing for Everyone 2<\/b><\/a><br \/>\n<i>The University of Chicago via edX<br \/>\n<\/i>This course focuses on the mathematics, programming, operations, and algorithms of quantum computing<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/learning-research-skills-23169\"><b>Learning Research Skills<\/b><\/a><br \/>\n<i>Arizona State University via Coursera<\/i><br \/>\nWrite multi-paragraph academic essays and deliver a collaborative academic presentation. Learn how to express your viewpoint and accurately support it with credible sources. Engage in each step of the academic writing process including the selection and evaluation of credible sources, paraphrasing and summarizing academic texts, synthesizing multiple sources in support of your viewpoint, and creating a reference page.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/harnessing-the-power-of-genomics-in-medicine-21916\"><b>Genomic Medicine: Harnessing the Power of the Human Genome<\/b><\/a><br \/>\n<i>University of Glasgow via FutureLearn<\/i><br \/>\nUsing the latest genomics research, discover how genomic technologies are changing how we understand and treat medical conditions.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-university-social-responsibility-24332\"><b>Introduction to University Social Responsibility<\/b><\/a><br \/>\n<i>Kyoto University via edX<br \/>\n<\/i>Learn about the general framework of University Social Responsibility (USR) and familiarize yourself with some effective practices to design, plan, implement, and evaluate your own USR activities.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/strategies-senior-housing-covid19-23267\"><b>Strategies for Senior Housing Communities during COVID-19<\/b><\/a><br \/>\n<i>Johns Hopkins University via Coursera<\/i><br \/>\nThis course provides comprehensive instruction and resources for property owners and managers, senior housing staff, service coordinators and providers, community housing leaders, and other senior housing stakeholders to build upon their emergency preparedness and response strategies related to COVID-19. The course lectures, interviews, and assignments are largely geared toward federally-subsidized, multifamily senior housing providers, but the material is relevant for all senior housing providers.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/cybersecurity-jobs-27205\"><b>Cybersecurity Job Search and Interviews: Getting Started<\/b><\/a><br \/>\n<i>University System of Georgia via Coursera<\/i><br \/>\nAre you planning to have a career in cybersecurity? This course can help you plan your preparation for such a career as well as give some advice on finding positions and landing a position.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-quantum-detectors-21184\"><b>Quantum Detectors<\/b><\/a><br \/>\n<i>Purdue University via edX<br \/>\n<\/i>Learn about quantum sensors and devices that extract maximal information from the world around us.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/shell-programming-a-necessity-for-all-programmers-22649\"><b>Shell Programming &#8211; A necessity for all Programmers<\/b><\/a><br \/>\n<i>Indian Institute of Technology Bombay via edX<br \/>\n<\/i>Unleash your Linux scripting skills and amaze others with your productivity level.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/sexuality-and-disability-25534\"><b>Community Awareness Course: Sexuality and Disability<\/b><\/a><br \/>\n<i>University of Minnesota via Coursera<\/i><br \/>\nThis community awareness course from the University of Minnesota Program on Human Sexuality will provide you with a solid introduction to human sexuality for those living with disabilities. Often there are assumptions that the disabled or differently abled people are not sexual, do not have sexual needs, or cannot be involved sexually. In this professionally produced one-hour course, you&#8217;ll learn about the basics of disabilities and human sexuality.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/perfectxl-microsoft-excel-course-25492\"><b>Excel Modeling for Professionals: Best Practices &amp; Pitfalls<\/b><\/a><br \/>\n<i>Delft University of Technology\u2028 via Coursera<\/i><br \/>\nThrough this course learners will gain the tools to decide whether or not Excel is the right software to use. They will learn how to set up good input data, format correctly, and the importance of good documentation.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/newhorrizon-23240\"><b>Try RRI! A guide for Responsible Research and Innovation<\/b><\/a><br \/>\n<i>University of Amsterdam via Coursera<\/i><br \/>\nIn this online course you will learn how to apply Responsible Research and Innovation (RRI) in your own work. First by understanding why it is important to act responsibly in your research and innovation processes at all.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/thermo-dynamics-23740\"><b>Basics of thermodynamics<\/b><\/a><br \/>\n<i>Novosibirsk State University via Coursera<\/i><br \/>\nOur course on the basics of thermodynamics targeting a wide audience includes only what is absolutely necessary, focusing on the most basic issues, excluding less important specialized topics. However, you will learn about unusual phenomena such as stretched liquid and see interesting experiments.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/antivaccination-and-vaccine-hesitancy-22044\"><b>Antivaccination and Vaccine Hesitancy<\/b><\/a><br \/>\n<i>University of Queensland via edX<br \/>\n<\/i>Join us on AVAXX101 to increase your understanding of vaccine hesitancy, and get equipped to respond to antivaccination claims.<b><\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The forty most popular free online university courses and MOOCS starting in February 2021.<\/p>\n","protected":false},"author":1,"featured_media":68727,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[94],"tags":[500],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>40 Most Popular Online Courses Starting in February 2021 — Class Central<\/title>\n<meta name=\"description\" content=\"The forty most popular free online university courses and MOOCS starting in February 2021.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"40 Most Popular Online Courses Starting in February 2021\" \/>\n<meta property=\"og:description\" content=\"The forty most popular free online university courses and MOOCS starting in February 2021.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2021-01-18T04:55:22+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-18T04:57:15+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1025\" \/>\n\t<meta property=\"og:image:height\" content=\"513\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\" \/>\n<meta name=\"twitter:creator\" content=\"@dhawalhshah\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dhawal Shah\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\",\"width\":1025,\"height\":513},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/\",\"name\":\"40 Most Popular Online Courses Starting in February 2021 — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#primaryimage\"},\"datePublished\":\"2021-01-18T04:55:22+00:00\",\"dateModified\":\"2021-01-18T04:57:15+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e\"},\"description\":\"The forty most popular free online university courses and MOOCS starting in February 2021.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"40 Most Popular Online Courses Starting in February 2021\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e\",\"name\":\"Dhawal Shah\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png\",\"caption\":\"Dhawal Shah\"},\"description\":\"Dhawal is the CEO of Class Central, the most popular search engine and review site for online courses and MOOCs. He has completed over a dozen MOOCs and has written over 200 articles about the MOOC space, including contributions to TechCrunch, EdSurge, Quartz, and VentureBeat.\",\"sameAs\":[\"https:\/\/www.classcentral.com\/\",\"https:\/\/twitter.com\/dhawalhshah\"],\"url\":\"https:\/\/www.classcentral.com\/report\/author\/dhawal\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"40 Most Popular Online Courses Starting in February 2021 — Class Central","description":"The forty most popular free online university courses and MOOCS starting in February 2021.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/","og_locale":"en_US","og_type":"article","og_title":"40 Most Popular Online Courses Starting in February 2021","og_description":"The forty most popular free online university courses and MOOCS starting in February 2021.","og_url":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2021-01-18T04:55:22+00:00","article_modified_time":"2021-01-18T04:57:15+00:00","og_image":[{"width":1025,"height":513,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_image":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png","twitter_creator":"@dhawalhshah","twitter_site":"@classcentral","twitter_misc":{"Written by":"Dhawal Shah","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png","width":1025,"height":513},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#webpage","url":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/","name":"40 Most Popular Online Courses Starting in February 2021 — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#primaryimage"},"datePublished":"2021-01-18T04:55:22+00:00","dateModified":"2021-01-18T04:57:15+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e"},"description":"The forty most popular free online university courses and MOOCS starting in February 2021.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/most-popular-february-2021\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"40 Most Popular Online Courses Starting in February 2021"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e","name":"Dhawal Shah","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png","caption":"Dhawal Shah"},"description":"Dhawal is the CEO of Class Central, the most popular search engine and review site for online courses and MOOCs. He has completed over a dozen MOOCs and has written over 200 articles about the MOOC space, including contributions to TechCrunch, EdSurge, Quartz, and VentureBeat.","sameAs":["https:\/\/www.classcentral.com\/","https:\/\/twitter.com\/dhawalhshah"],"url":"https:\/\/www.classcentral.com\/report\/author\/dhawal\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/74011"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=74011"}],"version-history":[{"count":3,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/74011\/revisions"}],"predecessor-version":[{"id":74014,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/74011\/revisions\/74014"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/68727"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=74011"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=74011"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=74011"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}