{"id":74417,"date":"2021-02-22T06:00:48","date_gmt":"2021-02-22T14:00:48","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=74417"},"modified":"2021-02-22T11:56:22","modified_gmt":"2021-02-22T19:56:22","slug":"most-popular-march-2021","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/","title":{"rendered":"35 Most Popular Online Courses Starting in March 2021"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-68727\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\" alt=\"\" width=\"1025\" height=\"513\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png 1025w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular-300x150.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular-768x384.png 768w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular-1024x512.png 1024w\" sizes=\"(max-width: 1025px) 100vw, 1025px\" \/><\/p>\n<p>Here are the thirty-five most popular free online university courses and <a href=\"https:\/\/www.classcentral.com\/help\/moocs\/\">Massive Open Online Courses<\/a> (MOOCS) starting in March 2021, based on Class Central learners&#8217; activity.<\/p>\n<p>You can find the entire catalog of 30,000 online courses offered by close to 1000 universities around the world on <a href=\"https:\/\/www.classcentral.com\/subjects\">Class Central&#8217;s subject page<\/a>.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/competitive-programming-for-beginners-27986\"><b>Competitive Programming for Beginners<\/b><\/a><br \/>\n<i>Moscow Institute of Physics and Technology via Coursera<\/i><br \/>\nThis online course will help you to join the world of competitive programming and even become worldwide competitions participant! The course includes theoretical and practical aspects that are necessary to solve problems of any difficulties.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-implant-dentistry-17214\"><b>Implant Dentistry<\/b><\/a><br \/>\n<i>The University of Hong Kong via edX<br \/>\n<\/i>Learn Implant Dentistry from world-class specialists and researchers! Join the state of art in the biology, the technology and clinical management in implant dentistry today!<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/ai-law-27963\"><b>AI &amp; Law <\/b><\/a><br \/>\n<i>Lund University via Coursera<\/i><br \/>\nThis four-week course titled AI and Law explores the way in which the increasing use of artificially intelligent technologies (AI) affects the practice and administration of law defined in a broad sense. Subject matters discussed include the connection be between AI and Law in the context of legal responsibility, law-making, law-enforcing, criminal law, the medical sector and intellectual property law.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-digital-platforms-in-performance-21288\"><b>Digital Platforms in Performance<\/b><\/a><br \/>\n<i>University of Cambridge via edX<br \/>\n<\/i>Advance your digital story-telling prowess and learn how to create interactive gameplay scripts for video games, radio drama scripts for radio and\/or podcasting, as well as content for your YouTube channel. Learn to transfer your skill as a dramatist into these innovative mediums.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/cybersecurity-jobs-27205\"><b>Cybersecurity Job Search and Interviews: Getting Started<\/b><\/a><br \/>\n<i>University System of Georgia via Coursera<\/i><br \/>\nAre you planning to have a career in cybersecurity? This course can help you plan your preparation for such a career as well as give some advice on finding positions and landing a position.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-health-psychology-32195\"><b>Introduction to Health Psychology<\/b><\/a><br \/>\n<i>University of Padova via FutureLearn<\/i><br \/>\nLearn about the importance of psychology in healthcare, how it can improve policymaking and patient outcomes.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/web-mobile-testing-19610\"><b>Web and Mobile Testing with Selenium<\/b><\/a><br \/>\n<i>University of Minnesota via Coursera<\/i><br \/>\nWe will cover key concepts relevant to testing of web and mobile platforms, underlying techniques and the use of Selenium as a framework for automating testing of such applications. The learner will gain a solid foundation in web and mobile testing principles and the ability to use a testing framework to automate test execution.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/financialaccounting-32116\"><b>What is Financial Accounting?<\/b><\/a><br \/>\n<i>University of California, Irvine via Coursera<\/i><br \/>\nStudents are introduced to the field of financial accounting through defining the foundational activities, tools, and users of financial accounting. Students learn to use the accounting equation and are introduced to the four major financial statements. Additional topics include ethical considerations, recording business transactions, and the application of credit\/debit rules.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/project-initiation-planning-32235\"><b>Project Initiation and Planning<\/b><\/a><br \/>\n<i>University of Illinois at Urbana-Champaign via Coursera<\/i><br \/>\nIn today’s competitive environment learning to effectively manage projects is a critical skill. This course will focus on initiating and planning projects. The course will cover the more traditional linear process, like waterfall approach, as well as the dynamic and iterative approach of agile and hybrid models, so the learners can decide when one approach is more suitable for any of their projects to maximize the chances of a successful outcome!<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/assessing-and-improving-community-health-27968\"><b>Assessing and Improving Community Health<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nThis course is intended to serve as an introduction to population health from both the vantage point of both public health and healthcare. We will examine the key components of community health needs assessments, how they are used, and how to compare population health assessments across subpopulations and time.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/the-influence-of-social-context-on-health-27966\"><b>The Influence of Social Context on Health<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nAfter taking this course, you will be able to identify ways in which conditions in the healthcare setting and at work, school, and home influence health; identify models for considering how the social context provides both sources of stress and sources of support for health; and explain how social and physical environments, including schools and workplaces, the healthcare system, and neighborhoods, shape health and health inequalities over the life course.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/modern-monetary-theory-economics-for-the-21st-cen-23312\"><b>Modern Monetary Theory: Economics for the 21st Century<\/b><\/a><br \/>\n<i>University of Newcastle via edX<br \/>\n<\/i>Demystify macroeconomic principles and terminology and discover how Modern Monetary Theory (MMT) provides explanations for some of the world&#8217;s most troubling financial concerns.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/social-determinants-of-health-27965\"><b>Social Determinants of Health <\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nThis course will increase your awareness, knowledge, and understanding of issues related to behavioral, psychological, and structural factors that contribute to understanding population health and health inequities. We will discuss conceptual and methodological issues key to health professionals working towards achieving health equity to reduce health disparities at multiple levels of influence. There will be opportunities to practice skills involving cultural humility, deliberative dialogues and professional self-assessments.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/foundations-of-mindfulness-ii-living-with-balance-27225\"><b>Mindfulness and Well-being: Living with Balance and Ease<\/b><\/a><br \/>\n<i>Rice University via Coursera<\/i><br \/>\nThis is the sequel course to Foundations of Mindfulness that will continue to provide a broad overview of the fundamental concepts, principles, and practices of mindfulness. With interactive exercises to help students explore their own attitudes, mental habits and behaviors, Foundations of Mindfulness series offers a pathway for living with more freedom, authenticity and ease.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/international-business-culture-32236\"><b>International Business and Culture<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nIn this course, learners develop a solid understanding of how national cultures shape international human resource management, international marketing, and international business generally. The course provides an overview of international culture, human resource management (HRM), and marketing.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/real-time-project-embedded-systems-27220\"><b>Real-Time Project for Embedded Systems<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nThis course can also be taken for academic credit as ECEA 5318, part of CU Boulder’s Master of Science in Electrical Engineering degree. The final course emphasizes hands-on building of an application using real-time machine vision and multiple real-time services to synchronize the internal state of Linux with an external clock via observation.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-evolutionary-medicine-microbes-medicine-and-humanity-s-quest-for-survival-17927\"><b>Evolutionary Medicine: Microbes, Medicine, and Humanity&#8217;s Quest for Survival<\/b><\/a><br \/>\n<i>Arizona State University via edX<br \/>\n<\/i>Explore the complex relationships between people, pathogens, and our evolutionary past in the first MOOC on evolutionary medicine.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-nutrition-communication-for-health-professionals-applying-skills-21064\"><b>Nutrition Communication for Health Professionals: Applying skills<\/b><\/a><br \/>\n<i>University of Newcastle via edX<br \/>\n<\/i>Develop effective communication skills to support your patients who may be trying to improve their diet to prevent or manage type 2 diabetes and cardiovascular disease. Learn how to apply techniques for communication of evidence-based brief nutrition messages, explain common misconceptions, and identify when to refer to a dietitian for medical nutrition therapy.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/art-comes-first-exploring-the-intersection-of-sty-24321\"><b>Art Comes First: Exploring the Intersection of Style and Identity<\/b><\/a><br \/>\n<i>Hopenclass via FutureLearn<\/i><br \/>\nExercise creative brand development skills and learn how to build a brand with an authentic identity and style.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/construction-industry-forward-27985\"><b>The Construction Industry: The Way Forward<\/b><\/a><br \/>\n<i>Columbia University via Coursera<\/i><br \/>\nThis course provides an introduction on types of the construction projects as well as the main concern of the productivity challenge in the construction industry. Through case studies, you will learn the industry characteristics and its unique environment that led to such productivity performance as well as touch base on other several examples of challenges we are facing internally in the industry.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/covid-19-genome-assembly-27206\"><b>Hacking COVID-19 — Course 1: Identifying a Deadly Pathogen<\/b><\/a><br \/>\n<i>University of California, San Diego via Coursera<\/i><br \/>\nIn this course, you will follow in the footsteps of the bioinformaticians investigating the COVID-19 outbreak by assembling the SARS-CoV-2 genome. Whether you’re new to the world of computational biology, or you’re a bioinformatics expert seeking to learn about its applications in the COVID-19 pandemic, or somewhere in between, this course is for you!<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-ethics-for-business-leaders-32593\"><b>Business Ethics: An Introduction to Ethics for Business Leaders<\/b><\/a><br \/>\n<i>Dublin City University via FutureLearn<\/i><br \/>\nIdentify the role that business ethics plays within a working environment with Dublin City University.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/calculus-through-data-and-modelling-precalculus-r-27987\"><b>Calculus through Data &amp; Modeling: Precalculus Review<\/b><\/a><br \/>\n<i>Johns Hopkins University via Coursera<\/i><br \/>\nThis course is an applications-oriented, investigative approach to the study of the mathematical topics needed for further coursework in single and multivariable calculus. The unifying theme is the study of functions, including polynomial, rational, exponential, logarithmic, and trigonometric functions. An emphasis is placed on using these functions to model and analyze data. Graphing calculators and\/or the computer will be used as an integral part of the course.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/how-software-ate-finance-27230\"><b>How Software Ate Finance<\/b><\/a><br \/>\n<i>Stanford University via Coursera<\/i><br \/>\nSoftware is eating the world, with radical consequences for financial services. This course gives you a foundation for understanding the future of financial services, and provides guidance for creating fintech businesses in the 2020s and beyond.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/security-governance-compliance-32124\"><b>Security Governance &amp; Compliance<\/b><\/a><br \/>\n<i>University of California, Irvine via Coursera<\/i><br \/>\nStudents are introduced to the field of cyber security with a focus on the domain of security &amp; risk management. Topics include the fundamental concepts and goals of cybersecurity (the CIA triad), security governance design, the NIST cybersecurity framework, relevant laws and regulations, and the roles of policies, strategies, and procedures in cybersecurity governance.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/aquaponics-the-circular-food-production-system-21911\"><b>Aquaponics – the circular food production system<\/b><\/a><br \/>\n<i>Zurich University of Applied Sciences via edX<br \/>\n<\/i><span lang=\"EN-GB\">Aquaponics is polyculture which combines aquaculture and hydroponics cultivation, i.e. fish farming and soil-independent food production, in a circulatory system with the aim of recycling nutrients from fish farming wastewater. In this MOOC course of the ZHAW you will learn the most important points about aquaponics and how to plan and design such a sustainable production system.<\/span><\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/international-portfolio-managment-31696\"><b>International Portfolio Managment<\/b><\/a><br \/>\n<i>Tomsk State University via Coursera<\/i><br \/>\nThis course explains how today&#8217;s portfolio management industry differs from the Harry Markowitz model and how to master it on your own using the Mythbusters&#8217; method and R project as your home financial laboratory.<br \/>\n<b><\/b><br \/>\n<a href=\"https:\/\/www.classcentral.com\/course\/edx-quantum-networking-21182\"><b>Quantum Networking<\/b><\/a><br \/>\n<i>Purdue University via edX<br \/>\n<\/i>Learn about the science and engineering of future quantum networks whose security is guaranteed by laws of quantum physics.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/designing-building-antiracist-spaces-27245\"><b>Designing and Building Institutional Anti-Racist Spaces<\/b><\/a><br \/>\n<i>Wesleyan University via Coursera<\/i><br \/>\nDesigning and Building an Antiracist Institutional Space (D-BIAS) is a course whose mission is to teach and apply tenets of equity, anti-racism, and cultural justice to students from Institutions to achieve social change. The course is aimed at educators and administrators in educational spaces, lawyers and advocates in spaces that touch civil rights, equity, and whose Institutional mission it is to achieve greater cultural equity.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/linguistic-diversity-what-for-32216\"><b>Linguistic Diversity, What for?<\/b><\/a><br \/>\n<i>Universitat Autònoma de Barcelona (Autonomous University of Barcelona) via Coursera<\/i><br \/>\nIn this course we approach linguistic diversity and multilingualism not only from a theoretical point of view, but also from a perspective oriented to help understand and manage various contexts that emerge from diversity in different environments of social interaction.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/take-action-from-protest-to-policy-27246\"><b>Take Action: From Protest to Policy<\/b><\/a><br \/>\n<i>Wesleyan University via Coursera<\/i><br \/>\nBy the end of this course, you will be able to formulate a comprehensive plan for real world change. This course will engage you if you care about specific issues such as climate change, racial justice, or mass incarceration, or if you want a broader understanding of how the U.S. courts and justice system operate, how communications professionals think about social media strategy, how change-makers network with policymakers, or how local actors and positive deviants possess answers to complex social problems.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/game-design-and-development-1-32228\"><b>Game Design and Development 1: 2D Shooter<\/b><\/a><br \/>\n<i>Michigan State University via Coursera<\/i><br \/>\nIn this course you will familiarize yourself with the tools and practices of game development and well as the process. You will get started developing video games using industry standard game development tools, including the Unity 2020 game engine. At the end of the course you will have completed two hands-on projects, including an Intro to Unity project and a 2D Shooter game, and will be able to leverage an array of game development techniques to create your own basic games.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/antibiotic-resistance-non-fermenting-gram-negativ-24320\"><b>Challenges in Antibiotic Resistance: Non-Fermenting Gram Negative Bacteria<\/b><\/a><br \/>\n<i>The British Society for Antimicrobial Chemotherapy via FutureLearn<\/i><br \/>\nGain an understanding of antibiotic resistance in non-fermenting gram negative bacteria.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/human-resources-analytics-32615\"><b>Human Resources Analytics<\/b><\/a><br \/>\n<i>University of California, Irvine via Coursera<\/i><br \/>\nWith advances in technology and cloud computing, there are now numerous data sources available to guide decision-making and drive organizational success. Harvesting the right kind of data requires that HR teams possess strong analytical skills; high-performing HR teams know that their function is to leverage data as a “decision science” by identifying metrics and data sources that deliver organizational insights.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/photovoltaic-systems-27969\"><b>Photovoltaic Systems<\/b><\/a><br \/>\n<i>Technical University of Denmark (DTU) via Coursera<\/i><br \/>\nThis course offers you advanced knowledge within the field of photovoltaic system technology. We&#8217;ll learn about the solar resource and how photovoltaic energy conversion is used to produce electric power. From this fundamental starting point we&#8217;ll cover the design and fabrication of different solar cell and module technologies, the various photovoltaic system components, how to design a photovoltaic plant and carry out energy yield simulations, essentials in energy economics, O&amp;M and reliability assessment, as well as the role of photovoltaic energy in sustainable energy systems.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The thirty-five most popular free online university courses and MOOCS starting in March 2021.<\/p>\n","protected":false},"author":1,"featured_media":68727,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[94],"tags":[500],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>35 Most Popular Online Courses Starting in March 2021 — Class Central<\/title>\n<meta name=\"description\" content=\"The thirty-five most popular free online university courses and MOOCS starting in March 2021.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"35 Most Popular Online Courses Starting in March 2021\" \/>\n<meta property=\"og:description\" content=\"The thirty-five most popular free online university courses and MOOCS starting in March 2021.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2021-02-22T14:00:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-02-22T19:56:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1025\" \/>\n\t<meta property=\"og:image:height\" content=\"513\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\" \/>\n<meta name=\"twitter:creator\" content=\"@dhawalhshah\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dhawal Shah\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png\",\"width\":1025,\"height\":513},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/\",\"name\":\"35 Most Popular Online Courses Starting in March 2021 — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#primaryimage\"},\"datePublished\":\"2021-02-22T14:00:48+00:00\",\"dateModified\":\"2021-02-22T19:56:22+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e\"},\"description\":\"The thirty-five most popular free online university courses and MOOCS starting in March 2021.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"35 Most Popular Online Courses Starting in March 2021\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e\",\"name\":\"Dhawal Shah\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png\",\"caption\":\"Dhawal Shah\"},\"description\":\"Dhawal is the CEO of Class Central, the most popular search engine and review site for online courses and MOOCs. He has completed over a dozen MOOCs and has written over 200 articles about the MOOC space, including contributions to TechCrunch, EdSurge, Quartz, and VentureBeat.\",\"sameAs\":[\"https:\/\/www.classcentral.com\/\",\"https:\/\/twitter.com\/dhawalhshah\"],\"url\":\"https:\/\/www.classcentral.com\/report\/author\/dhawal\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"35 Most Popular Online Courses Starting in March 2021 — Class Central","description":"The thirty-five most popular free online university courses and MOOCS starting in March 2021.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/","og_locale":"en_US","og_type":"article","og_title":"35 Most Popular Online Courses Starting in March 2021","og_description":"The thirty-five most popular free online university courses and MOOCS starting in March 2021.","og_url":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2021-02-22T14:00:48+00:00","article_modified_time":"2021-02-22T19:56:22+00:00","og_image":[{"width":1025,"height":513,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_image":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png","twitter_creator":"@dhawalhshah","twitter_site":"@classcentral","twitter_misc":{"Written by":"Dhawal Shah","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/04\/banner-social-tracker-most-popular.png","width":1025,"height":513},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#webpage","url":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/","name":"35 Most Popular Online Courses Starting in March 2021 — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#primaryimage"},"datePublished":"2021-02-22T14:00:48+00:00","dateModified":"2021-02-22T19:56:22+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e"},"description":"The thirty-five most popular free online university courses and MOOCS starting in March 2021.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2021\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"35 Most Popular Online Courses Starting in March 2021"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e","name":"Dhawal Shah","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png","caption":"Dhawal Shah"},"description":"Dhawal is the CEO of Class Central, the most popular search engine and review site for online courses and MOOCs. He has completed over a dozen MOOCs and has written over 200 articles about the MOOC space, including contributions to TechCrunch, EdSurge, Quartz, and VentureBeat.","sameAs":["https:\/\/www.classcentral.com\/","https:\/\/twitter.com\/dhawalhshah"],"url":"https:\/\/www.classcentral.com\/report\/author\/dhawal\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/74417"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=74417"}],"version-history":[{"count":9,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/74417\/revisions"}],"predecessor-version":[{"id":74446,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/74417\/revisions\/74446"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/68727"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=74417"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=74417"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=74417"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}