{"id":75759,"date":"2021-06-16T12:06:51","date_gmt":"2021-06-16T19:06:51","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=75759"},"modified":"2021-06-21T12:51:33","modified_gmt":"2021-06-21T19:51:33","slug":"lambda-school-woes","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/","title":{"rendered":"Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny"},"content":{"rendered":"<p>In Silicon Valley, Lambda School has been widely held up as an innovator in education. The company helped popularize the use of Income Share Agreements, and its online only model helped bring coding education to the entire country.<\/p>\n<p>But at a time when education companies have seen their prospects soar due to the pandemic, Lambda School has struggled. In early May, <a href=\"https:\/\/techcrunch.com\/2021\/05\/13\/lambda-school-lawsuits\/\">three former students sued the school<\/a>. This was the latest development in a saga that included accusations of fraud, layoffs, and an overall poor quality of education.<\/p>\n<h2>Rapid Growth<\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-school-early-website-screenshot.png\"><img loading=\"lazy\" class=\"alignnone wp-image-75760 size-large\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-school-early-website-screenshot-1024x539.png\" alt=\"\" width=\"1024\" height=\"539\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-school-early-website-screenshot-1024x539.png 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-school-early-website-screenshot-300x158.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-school-early-website-screenshot-768x404.png 768w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-school-early-website-screenshot.png 1113w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><br \/>\n<a href=\"https:\/\/web.archive.org\/web\/20160824203559\/http:\/\/lambdaschool.com:80\/\"><i>Lambda School in 2016<\/i><\/a><\/p>\n<p>From the beginning, Lambda School has lacked a clear direction and clear philosophy about how to disrupt education. The name Lambda School is a case in point: Lambda is a reference to a function programming concept, and Lambda School <a href=\"https:\/\/web.archive.org\/web\/20190127150150\/https:\/twitter.com\/AustenAllred\/status\/1049763690138849285\">originally<\/a> was <a href=\"https:\/\/web.archive.org\/web\/20160816220132\/http:\/\/lambdaschool.com:80\/\">intended to be an online Haskell textbook<\/a>. The pivot from an interactive online textbook to a full fledged coding bootcamp was the first of many major changes to Lambda’s educational structure.<\/p>\n<p>In 2017, Lambda School joined YCombinator, a prominent startup accelerator. At this point, Lambda School’s curriculum <a href=\"https:\/\/web.archive.org\/web\/20171015132927\/https:\/\/lambdaschool.com\/\">was advertised as<\/a> “a small class undergoes live, intensive online training.” Lambda’s website promised students “frequent code reviews from knowledgeable instructors” and that the education would be “Just like a physical classroom experience” despite taking place online.<\/p>\n<p>After receiving funding, Lambda School scaled up and rapidly grew its enrollment. But a larger student body meant it was harder for Lambda to continue to provide small class sizes. By the beginning of 2020, Lambda School had developed a new model where each instructor was assigned to <a href=\"https:\/\/www.theverge.com\/2020\/2\/11\/21131848\/lambda-school-coding-bootcamp-isa-tuition-cost-free\">upwards of sixty students<\/a>, a far cry from the small classes promised at the beginning. But students were also assigned to a “team lead”, a former student who was paid about thirteen dollars an hour to assist with instruction. This model helped cut costs while still allowing students to have regular contact with some sort of an instructor.<\/p>\n<table>\n<tbody>\n<tr>\n<td>Year<\/td>\n<td>Lambda School Alumni (per LinkedIn as of May 14, 2021)<\/td>\n<\/tr>\n<tr>\n<td>2017<\/td>\n<td>120<\/td>\n<\/tr>\n<tr>\n<td>2018<\/td>\n<td>777<\/td>\n<\/tr>\n<tr>\n<td>2019<\/td>\n<td>2,714<\/td>\n<\/tr>\n<tr>\n<td>2020<\/td>\n<td>2,847<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Lambda School’s growth relied in part on launching new programs in foreign countries and in professions that were unfamiliar with a coding bootcamp education model. In 2019, Lambda School was reportedly considering <a href=\"https:\/\/yourstory.com\/2019\/09\/lambda-school-coding-bootcamp-india-education\/amp\">expanding to India<\/a>, having already launched programs in <a href=\"https:\/\/paystack.com\/lambda\">Africa<\/a>, <a href=\"https:\/\/www.coursereport.com\/blog\/lambda-schools-europe-income-share-agreement\">the UK and the EU<\/a>. Lambda School expanded from its web design program and launched programs in User Experience, Data Science, iOS development and Android development. At one point, Lambda School was also reportedly considering <a href=\"https:\/\/www.economist.com\/business\/2019\/04\/27\/lambda-an-online-school-wants-to-teach-nursing\">buying a nursing college<\/a> and launching programs unrelated to software engineering.<\/p>\n<p>The rapid pace of growth proved hard to maintain and many of Lambda’s expansions have since been rolled back. A Lambda nursing school has yet to materialize, and Lambda’s new programs, such as its user experience program, were the subject of negative articles in the media. In particular, Lambda School’s User Experience curriculum was the subject of <a href=\"https:\/\/www.theverge.com\/2020\/2\/11\/21131848\/lambda-school-coding-bootcamp-isa-tuition-cost-free\">a Verge<\/a> article where students alleged that the curriculum was plagiarised and that instructors were ill equipped to teach the course. Today, Lambda appears to have shut down many of its programs, and its website only <a href=\"https:\/\/lambdaschool.com\/faq\">advertises<\/a> two programs: one in data science and one in full stack web development (with a Backend Development bootcamp “coming soon”).<\/p>\n<p>In general, the period between 2019 and 2020 was when Lambda School began to see a steady stream of <a href=\"https:\/\/hashtagcauseascene.com\/podcast\/jonathan-martinez\/\">criticism<\/a> from the media as well as <a href=\"https:\/\/twitter.com\/keziyahl\/status\/1155154616281178114?lang=en\">anonymous<\/a> <a href=\"https:\/\/twitter.com\/codequeenj\">accounts<\/a> on social media, as well as its <a href=\"https:\/\/redd.it\/nbrwra\">own<\/a> <a href=\"https:\/\/redd.it\/nn3ygq\">subreddit<\/a>. Beginning with <a href=\"https:\/\/www.businessinsider.com\/lambda-school-coding-bootcamp-y-combinator-cult-2019-10\">an article from Business Insider<\/a>, and continuing with articles from <a href=\"https:\/\/www.theverge.com\/2020\/2\/11\/21131848\/lambda-school-coding-bootcamp-isa-tuition-cost-free\">The Verge<\/a> and <a href=\"https:\/\/nymag.com\/intelligencer\/2020\/02\/lambda-schools-job-placement-rate-is-lower-than-claimed.html\">New York Magazine<\/a>, the articles detailed student complaints with the instruction, with the rapidly changing nature of the curriculum, and the quality of education more generally. In February 2020, New York Magazine alleged that Lambda School had fraudulently inflated its outcomes metrics, and that roughly half of all students received jobs, a claim <a href=\"https:\/\/www.classcentral.com\/report\/are-isas-affordable\/\">substantiated by investor documents<\/a> which claimed that 53% of all enrolled students received jobs.<\/p>\n<p>One month later, the coronavirus pandemic reached the US. The impact on online education companies was immediate, with companies like Coursera and EdX seeing huge increases in their <a href=\"https:\/\/www.classcentral.com\/report\/surging-interest-in-online-education\/\">online traffic<\/a> and <a href=\"https:\/\/www.classcentral.com\/report\/coursera-q1-2021\/\">revenue<\/a>. But for Lambda School, despite being an online education company, the challenges were just beginning.<\/p>\n<h2>Elimination of Team Leads<\/h2>\n<p>On September 21st 2020, Lambda School introduced a new program called “Lambda Leadership.” On Lambda School’s website, Lambda Leadership was <a href=\"https:\/\/lambdaschool.com\/lambda-leadership\">portrayed as<\/a> a way to provide “opportunities for all students to build fundamental leadership skills.” But Lambda Leadership also included several changes to Lambda’s curriculum. These changes included shortening the curriculum to <a href=\"https:\/\/lambdaschool.com\/the-commons\/announcing-job-search-instruction-and-program-length-changes-to-the-lambda-school-curriculum\">six months<\/a> from <a href=\"https:\/\/www.wired.com\/story\/how-we-learn-lambda-income-sharing-agreements\/\">nine months<\/a>, which was a change that applied retroactively to students still enrolled in the program, per an internal FAQ examined by Class Central. Students were technically given the option to “opt out” of the shortened curriculum, per that same FAQ, but the FAQ also was unclear about when that option would be available (“Available to students once we&#8217;ve launched this program.”)<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/shortened-school-faq.png\"><img loading=\"lazy\" class=\"alignnone wp-image-75762 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/shortened-school-faq.png\" alt=\"\" width=\"711\" height=\"600\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/shortened-school-faq.png 711w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/shortened-school-faq-300x253.png 300w\" sizes=\"(max-width: 711px) 100vw, 711px\" \/><\/a><\/p>\n<p>Another change involved getting rid of paid team leads (aka TLs, or former students who assisted with instruction). This change had a particularly significant impact on grading, as the team leads were previously responsible for grading. To compensate, Lambda School announced that they would replace TL assigned scores with “self assessments,” per the copy of the FAQ. In effect, students would be grading themselves. The FAQ justified the change by claiming “it&#8217;s not about us testing you or giving you a score or grade, it&#8217;s about working with you to understand where you are, where you need help, and what happens next.”<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-leadership-who-grades.png\"><img loading=\"lazy\" class=\"alignnone wp-image-75763 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-leadership-who-grades.png\" alt=\"\" width=\"578\" height=\"624\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-leadership-who-grades.png 578w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/lambda-leadership-who-grades-278x300.png 278w\" sizes=\"(max-width: 578px) 100vw, 578px\" \/><\/a><\/p>\n<p>In place of the team leads, Lambda School announced that they would move to a peer mentorship model. In this model, students would <a href=\"https:\/\/lambdaschool.com\/lambda-leadership\">meet regularly<\/a> with a student two units ahead of them as well as a student two units behind them. Notably, unlike the Team Leads, student mentors were not paid.<\/p>\n<p>As part of the change, Lambda School <a href=\"https:\/\/lambdaschool.com\/the-commons\/announcing-job-search-instruction-and-program-length-changes-to-the-lambda-school-curriculum\">promised<\/a> to more than double the instructional staff. This would have been aided by shortening the length of the program: with a six month program each instructor could teach two cohorts of students a year instead of one and a half cohorts they taught previously.<\/p>\n<h2>Aligned Incentives<\/h2>\n<p>One of Lambda School’s selling points was that students could finance their education through the use of Income Share Agreements (ISAs). In Lambda’s ISA, students agreed to give Lambda a percentage of their income for a specified number of years, in exchange for Lambda paying for the students’ education. Income Share Agreements aren’t new &#8212; Yale first introduced the product in the 1970s &#8212; but Lambda helped popularize the idea years later.<\/p>\n<p>Lambda’s ISA has a number of selling points. Lambda claimed (and <a href=\"https:\/\/lambdaschool.com\/faq\">still claims<\/a>) that its ISA is not debt and that its ISA allows students to attend without taking on additional debt. Lambda also claimed that its ISA allowed Lambda to align its financial incentives with the incentives of students to get a job. Because Lambda is paid a percentage of its graduates&#8217; salaries, theoretically if its graduates got jobs and made more money after graduating, Lambda would theoretically make more money.<\/p>\n<p>The terms of Lambda’s ISA include some safeguards. In Lambda’s ISA, students need to make a minimum income each month before they are on the hook for the payments. Lambda’s ISA also has a cap, or a maximum total amount students can pay, as well as a maximum length after which the agreement expires. Finally, Lambda’s ISA claims that students will only need to make payments if they are working in a field related to what they studied.<\/p>\n<p>The terms of Lambda’s ISA are as follows. Students agree to pay <a href=\"https:\/\/lambdaschool.com\/isa\">17% of their income<\/a> during months where they earn more than $4,167 per month, for a maximum of 24 months. If a student pays more than $30,000 in total, or if a student has graduated more than five years ago, the agreement expires.<\/p>\n<p>But Lambda’s ISA has led to controversy. According to the New York Magazine, at one point Lambda was <a href=\"https:\/\/nymag.com\/intelligencer\/2020\/02\/lambda-schools-job-placement-rate-is-lower-than-claimed.html\">directly selling its ISAs<\/a> to an investor in exchange for a flat fee per ISA. This means that while long term Lambda might have an incentive to ensure the ISAs did well so investors would continue to buy ISAs, in the short term Lambda wouldn’t see any direct financial impact from the job placement outcomes of their students. Lambda for its part has <a href=\"https:\/\/lambdaschool.com\/the-commons\/announcing-our-new-isa-financing-blueprint-and-100m-in-new-financing\">announced a more complicated financing relationship<\/a>, but questions still remain to what extent the incentives are aligned.<\/p>\n<p>And many questions can be asked about the affordability of ISAs like Lambda’s. Lambda’s ISA has an advantage over student loans in that if borrowers don’t have a job they don’t have to pay. But unlike student loan borrowers, borrowers with ISAs are <a href=\"https:\/\/protectborrowers.org\/isa-prepayment-blog\/\">barred from refinancing their ISAs<\/a> to take advantage of lower interest rates. Comparisons between ISAs and loans are difficult because they use different metrics (e.g. loans publish interest rates), but the math suggests that students with ISAs may pay <a href=\"https:\/\/www.classcentral.com\/report\/are-isas-affordable\/\">significantly more overall<\/a> than students with loans.<\/p>\n<p>At least one US state &#8212; California &#8212; has taken aggressive action to limit the availability of ISAs in the state. As a condition to get approval to operate in California, in 2020 Lambda <a href=\"https:\/\/lambdaschool.com\/the-commons\/lambda-school-approved-bppe-california\">agreed to discontinue its ISA offering<\/a> for students in California.<\/p>\n<h2>“But long term it doesn’t matter, so keep going.”<\/h2>\n<p>From the end of April to the beginning of May, Lambda School faced a rapid series of setbacks. On April 26, Lambda School reached a <a href=\"https:\/\/dfpi.ca.gov\/2021\/04\/26\/lambda-school-reaches-settlement-with-dfpi-agreeing-to-end-deceptive-educational-financing-practices\/\">settlement<\/a> with a California consumer protection agency. Three days later, on April 29, Lambda School laid off <a href=\"https:\/\/lambdaschool.com\/the-commons\/update-lambda-school-team\">sixty five<\/a> employees and announced that they were suspending enrollments in their part time programs. The layoffs included several employees in student-facing roles, such as career coaches who played a large role in helping graduates land jobs, according to LinkedIn profiles reviewed by Class Central. Finally, on May 13, three former students <a href=\"https:\/\/techcrunch.com\/2021\/05\/13\/lambda-school-lawsuits\/\">initiated a lawsuit<\/a> against Lambda School.<\/p>\n<p>Lambda School is a company that personifies the Silicon Valley ethos of move fast and break things. For example, when announcing the peer mentorship structure, Lambda’s ex-President Caleb Hicks told students that “One of my favorite things about being at Lambda instead of a traditional school is that we can move quickly. While it&#8217;s hard to move as quickly as we could when we were 10-20 people, we can iterate and improve on a week over week and month over month basis.” (On June 1st, Hicks became the <a href=\"https:\/\/twitter.com\/calebhicks\/status\/1399797155741667330\">latest Lambda executive to depart from the company<\/a>.)<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/caleb-screenshot-of-screenshot.png\"><img loading=\"lazy\" class=\"alignnone wp-image-75765 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/caleb-screenshot-of-screenshot.png\" alt=\"\" width=\"790\" height=\"606\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/caleb-screenshot-of-screenshot.png 790w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/caleb-screenshot-of-screenshot-300x230.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/caleb-screenshot-of-screenshot-768x589.png 768w\" sizes=\"(max-width: 790px) 100vw, 790px\" \/><\/a><\/p>\n<p>Lambda’s mission to reinvent education has won it the support of prominent Silicon Valley investors like Paul Graham, who stuck with the school despite outside criticism. A year ago, in response to criticism, Allred posted a message to the Lambda School Slack channel ostensibly from Paul Graham (Paul Graham later published a <a href=\"http:\/\/www.paulgraham.com\/fh.html\">blog post containing similar language<\/a>). “If you (a) do something really novel and (b) it becomes successful enough, you will gradually accumulate haters,” Graham’s message read. “But long term it doesn’t matter, so keep going.”<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/austen-paul-graham-screenshot.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-75766\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/austen-paul-graham-screenshot.png\" alt=\"\" width=\"642\" height=\"565\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/austen-paul-graham-screenshot.png 642w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/austen-paul-graham-screenshot-300x264.png 300w\" sizes=\"(max-width: 642px) 100vw, 642px\" \/><\/a><\/p>\n<p>Like many other companies in Silicon Valley, Lambda School has struggled with diversity, equity, and inclusion. In a Slack message during the summer of 2020, Allred admitted that &#8220;In many ways, we have failed to build a staff that reflects the diversity of our student community. We have also failed to deliver a diversity report, one that you have asked for. There are a number of reasons as to why this is true, but I know you don&#8217;t want to hear excuses. I have made this a priority for my staff.&#8221; (Lambda School subsequently did release a <a href=\"https:\/\/lambdaschool.com\/the-commons\/building-an-inclusive-future-2020-diversity-at-lambda-school\">diversity report<\/a> in July of 2020.)<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/austen-diversity-report-screenshot.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-75767\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/austen-diversity-report-screenshot.png\" alt=\"\" width=\"744\" height=\"575\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/austen-diversity-report-screenshot.png 744w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/austen-diversity-report-screenshot-300x232.png 300w\" sizes=\"(max-width: 744px) 100vw, 744px\" \/><\/a><\/p>\n<p>Unlike some competing coding bootcamps, Lambda School has eschewed <a href=\"https:\/\/www.highereddive.com\/news\/more-colleges-are-partnering-with-boot-camps-to-tap-demand-for-short-term-p\/594295\/\">partnerships with traditional universities<\/a> and opted to develop its programs on its own. On twitter, Allred compared accreditation, a process by which schools in the US get approval to receive funding for the federal government, <a href=\"https:\/\/web.archive.org\/web\/20210515000313\/https:\/\/twitter.com\/Austen\/status\/1078149294849290240\">to taxi medallions<\/a>. Given the struggles Lambda has faced trying to reinvent higher education instead of working within the system, other companies may take different routes in the future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>At a time when other education companies have benefited immensely from the pandemic, Lambda School has struggled.<\/p>\n","protected":false},"author":100,"featured_media":75771,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[103],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny — Class Central<\/title>\n<meta name=\"description\" content=\"At a time when other education companies have benefited immensely from the pandemic, Lambda School has struggled.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny\" \/>\n<meta property=\"og:description\" content=\"At a time when other education companies have benefited immensely from the pandemic, Lambda School has struggled.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2021-06-16T19:06:51+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-06-21T19:51:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-16-at-11-30-01-Online-Coding-School-and-Bootcamp-Lambda-School.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"626\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-16-at-11-30-01-Online-Coding-School-and-Bootcamp-Lambda-School.jpg\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Emma Rindlisbacher\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-16-at-11-30-01-Online-Coding-School-and-Bootcamp-Lambda-School.jpg\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-16-at-11-30-01-Online-Coding-School-and-Bootcamp-Lambda-School.jpg\",\"width\":1200,\"height\":626},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/\",\"name\":\"Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#primaryimage\"},\"datePublished\":\"2021-06-16T19:06:51+00:00\",\"dateModified\":\"2021-06-21T19:51:33+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/713e6c50dcee29aa5323d737b80ea9b0\"},\"description\":\"At a time when other education companies have benefited immensely from the pandemic, Lambda School has struggled.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/713e6c50dcee29aa5323d737b80ea9b0\",\"name\":\"Emma Rindlisbacher\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/0bb1e6adb619d79f513c28057aaa6272?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/0bb1e6adb619d79f513c28057aaa6272?s=96&d=mm&r=g\",\"caption\":\"Emma Rindlisbacher\"},\"description\":\"Emma is a reporter who covers education for national publications.\",\"url\":\"https:\/\/www.classcentral.com\/report\/author\/emma\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny — Class Central","description":"At a time when other education companies have benefited immensely from the pandemic, Lambda School has struggled.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/","og_locale":"en_US","og_type":"article","og_title":"Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny","og_description":"At a time when other education companies have benefited immensely from the pandemic, Lambda School has struggled.","og_url":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2021-06-16T19:06:51+00:00","article_modified_time":"2021-06-21T19:51:33+00:00","og_image":[{"width":1200,"height":626,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-16-at-11-30-01-Online-Coding-School-and-Bootcamp-Lambda-School.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_image":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-16-at-11-30-01-Online-Coding-School-and-Bootcamp-Lambda-School.jpg","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Emma Rindlisbacher","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-16-at-11-30-01-Online-Coding-School-and-Bootcamp-Lambda-School.jpg","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/06\/Screenshot-2021-06-16-at-11-30-01-Online-Coding-School-and-Bootcamp-Lambda-School.jpg","width":1200,"height":626},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#webpage","url":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/","name":"Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#primaryimage"},"datePublished":"2021-06-16T19:06:51+00:00","dateModified":"2021-06-21T19:51:33+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/713e6c50dcee29aa5323d737b80ea9b0"},"description":"At a time when other education companies have benefited immensely from the pandemic, Lambda School has struggled.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/lambda-school-woes\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/lambda-school-woes\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"Lambda School Woes: Lawsuits, Fines, Layoffs, and Media Scrutiny"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/713e6c50dcee29aa5323d737b80ea9b0","name":"Emma Rindlisbacher","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/0bb1e6adb619d79f513c28057aaa6272?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/0bb1e6adb619d79f513c28057aaa6272?s=96&d=mm&r=g","caption":"Emma Rindlisbacher"},"description":"Emma is a reporter who covers education for national publications.","url":"https:\/\/www.classcentral.com\/report\/author\/emma\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/75759"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/100"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=75759"}],"version-history":[{"count":12,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/75759\/revisions"}],"predecessor-version":[{"id":75794,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/75759\/revisions\/75794"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/75771"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=75759"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=75759"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=75759"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}