{"id":83515,"date":"2022-12-07T09:59:22","date_gmt":"2022-12-07T17:59:22","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=83515"},"modified":"2022-12-07T09:59:52","modified_gmt":"2022-12-07T17:59:52","slug":"review-lets-get-emotional","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/","title":{"rendered":"Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions"},"content":{"rendered":"<figure id=\"attachment_83516\" aria-describedby=\"caption-attachment-83516\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-83516 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor.png\" alt=\"\" width=\"1024\" height=\"512\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor.png 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor-300x150.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor-768x384.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption id=\"caption-attachment-83516\" class=\"wp-caption-text\">Professor Jocelyn Davis, course instructor<\/figcaption><\/figure>\n<p>This is an in-depth review of <a href=\"https:\/\/www.classcentral.com\/course\/edx-let-s-get-emotional-emotions-emotional-intelligence-19746\">Let’s Get Emotional: Emotions &amp; Emotional Intelligence!<\/a> by the <a href=\"https:\/\/www.classcentral.com\/university\/usmd\">University System of Maryland<\/a>.<\/p>\n<p>An incident early in my teaching career has often haunted me. A child weeping. Unable to express the reason. I inquired if he was upset, sad or plain angry. He just could not say anything but cry. His mother later told me that he was frustrated with himself for not doing as well as he wanted to. I too could not get the emotion he was feeling. All I could do was to make him laugh and drive away the gloom. But that left the problem unattended. It was a big failure on my part. An urge to get in-depth knowledge of emotions started growing within me.<\/p>\n<h2>Why I took this course<\/h2>\n<figure id=\"attachment_83520\" aria-describedby=\"caption-attachment-83520\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-83520 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-What-Are-Emotions-Part-1-Video.png\" alt=\"\" width=\"1024\" height=\"512\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-What-Are-Emotions-Part-1-Video.png 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-What-Are-Emotions-Part-1-Video-300x150.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-What-Are-Emotions-Part-1-Video-768x384.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption id=\"caption-attachment-83520\" class=\"wp-caption-text\">From &#8220;What Are Emotions Part 1&#8221; &#8211; Week 1<\/figcaption><\/figure>\n<p>I am an emotional person too. This has led me to many emotional experiences that have often left me feeling drained. It has placed me in awkward situations both professionally and personally. I dislike this trait of mine. I also wanted to learn the reasons why I reacted emotionally. I deal with people a lot. People who are a bundle of emotions. Some like me! I had no idea how to deal with emotions that overwhelm me. I am a retired teacher and spent most of my life teaching in schools. Teaching kids is not a light matter. It’s dealing with life in its purest form. Delicate and sensitive. Each child is different with various moods, feelings and responses. I often found my inability to cope with such sudden outbursts adequately, jarring. I could feel their emotions but did not have enough vocabulary to name them. It was the same with family, friends or even colleagues. Through the years I learned that emotions are the driving force in all aspects of life. And learning to utilize them intelligently leads to a successful and fulfilling life. I had taken a course from Harvard on <a href=\"https:\/\/www.classcentral.com\/course\/edx-the-path-to-happiness-what-chinese-philosophy-teaches-us-about-the-good-life-20046\">Chinese Philosophy<\/a>, by Michael Puett. A well-taught course. In China, a child is told to reflect on his reaction and actions from an early age. Confucian idea! This was the first step for me, in dealing with emotions. I learned how our actions and reactions are based on our previous experiences. The need to deliberate on our actions and reactions. I wanted to learn further. When I chanced upon this course, I had to go through it. For my self-improvement.<\/p>\n<h2>The Instructor<\/h2>\n<p>Professor Jocelyn Davis teaches the course <a href=\"https:\/\/www.classcentral.com\/course\/edx-let-s-get-emotional-emotions-emotional-intelligence-19746\">Let’s Get Emotional: Emotions &amp; Emotional Intelligence<\/a>. She is the President and co-founder of Nelson Hart LLC. It’s a women-owned consulting firm. The company works with clients from all sectors and helps them in the field of Team and Project Management. They have a striking motto, ‘Where individuals flourish and the organization thrives’. I feel it’s a great opportunity for professionals and individuals to learn from her!<\/p>\n<h2>The course<\/h2>\n<figure id=\"attachment_83518\" aria-describedby=\"caption-attachment-83518\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"size-full wp-image-83518\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Goal-Setting-Mini-Lesson-Smart-Goals.png\" alt=\"\" width=\"1024\" height=\"512\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Goal-Setting-Mini-Lesson-Smart-Goals.png 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Goal-Setting-Mini-Lesson-Smart-Goals-300x150.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Goal-Setting-Mini-Lesson-Smart-Goals-768x384.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption id=\"caption-attachment-83518\" class=\"wp-caption-text\">From &#8220;Goal-Setting Mini Lesson&#8221; &#8211; Setting Smart Goals<\/figcaption><\/figure>\n<p>It’s a four-week course. I studied daily for 3 hours. It took me roughly less than four weeks to complete the course.<\/p>\n<p>I learned a lot from this course. It deals with emotions, emotional intelligence and emotional style. Their impact on our health, happiness, professional and personal life. That emotional EI is different from EQ. Developing EQ and using EI leads to a successful life. Emotions range from basic to complex. Dissecting emotions and grading their intensity is useful. For example: we often say, ‘the person is angry’, probably because it’s the only word in our vocabulary. But it could be irritation, disappointment, fury or annoyance, etc. I, for the lack of proper vocabulary, used anger. Ex: My supervisor had asked me to submit a project. While reading my project, he frowned. I thought he was angry and unhappy with my presentation. It created discomfort in my mind and affected my work throughout the day. Later, I would learn it was not so. He was just thinking. My project was well done. I just let myself squirm for no reason. Spending energy on baseless unhealthy thoughts. Frowning does not equate to anger all the time. This course emphasizes the need for emotional vocabulary. I agree. I need to increase my emotional vocabulary so that I may be able to name the emotion as it runs through my mind or when I am watching the body language of the person. Naming the right emotion would help me evaluate my response and decide on the right action. Using the right words, and modulating tone, gesture, facial expressions, etc. are all essential for giving the right response. I have often misread emotions in my professional life.<\/p>\n<p>Our thoughts impact our brain and change how it functions. I did not know this. Strong emotions remain in memories. They change how we read the next message. The brain creates our emotions and influences our memory, attention and reasoning abilities. We must understand our different feelings, the triggers, and the reason for those feelings to help build EI. Reading these lines in black and white, I realize how important it is to take all these into perspective before coming to any conclusion. Judging situations correctly is very important. The method suggested is by paying attention to body language, reading the eyes, the tone and the facial expressions. Not only of the person we are interacting with but ourselves too. The way our body reacts, heart rate, sweat, and narrowing of the pupils are all indicators of the type of emotion and its intensity.<\/p>\n<p>I came to know that positive and negative emotions are not opposites. Both can co-exist! And are totally different emotions. Though both are for survival they work differently. Negative emotions narrow our focus. It stops us from thinking, reacting and behaving rationally. I now understand the reason why I get stuck in a groove when upset. My focus is narrowed! My intense negative emotion led to amygdala hijack, which is unwanted. Amygdala hijack is when, out of fear for our own safety, our brain reacts from its deepest emotional core, the amygdala. This is for survival and is not always useful. It is not based on logical thinking. The technique to use in changing our negative thoughts or obsolete ones is to rethink or reframe our old unhelpful experiences. Or moving from an unhealthy environment by changing windows. Thus, practicing emotional hygiene is also important. Getting rid of old negative memories is necessary since they have colored our minds. Letting outdated memories dictate our responses is self-defeating. We must develop new ways of thinking and our emotional style to have the desired outcome.  There are techniques suggested by which we could let out overwhelming negative energy. This is a strategy worth embracing. And it is simple. When overwhelmed or angry, step out for a walk, run or ‘change the frame.’ While positive feeling broadens our outlook providing ways to rationally work out the problem. It creates new opportunities, lessens stress, and opens our minds to new thoughts or ways to deal with obstacles. It also leads to good health too.<\/p>\n<p>It should also be kept in mind that our reactions could be based on gender, culture, rank or position in society or office. Ex: I find it very difficult to hear this generation’s use of ‘anyways’. It used to irritate me. Stepping out of my fixed zone, I realize that they either don’t know that adverbs have no plurals, (there are exceptions) or that it’s the present generation who use them differently. As slang! I need to refresh my outdated thoughts and go with the flow. It is not super important to stress about!<\/p>\n<figure id=\"attachment_83519\" aria-describedby=\"caption-attachment-83519\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-83519 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Action-Planning-Mini-Lesson-in-6-steps.png\" alt=\"\" width=\"1024\" height=\"512\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Action-Planning-Mini-Lesson-in-6-steps.png 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Action-Planning-Mini-Lesson-in-6-steps-300x150.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Action-Planning-Mini-Lesson-in-6-steps-768x384.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption id=\"caption-attachment-83519\" class=\"wp-caption-text\">From &#8220;Action Planning Mini Lesson in 6 steps&#8221; &#8211; Week 1<\/figcaption><\/figure>\n<p>Learning about self and emotions leads to greater control from self-sabotaging! How people read us during social interaction is crucial. We have to be in touch with our emotions and physical responses. Building self-awareness is paramount. It enhances the performance levels in all parts of life, personal and professional. We should be socially aware too. How we interact, respond, and project our feelings and how we behave in public are crucial. We are being constantly read and evaluated. Living in the mind and not properly externalizing thoughts may not have the desired result. There are techniques suggested that are easy to follow. Watching movies, reading good books, journaling and observing. And be always self-aware.<\/p>\n<p>The other interesting revelation to me was my emotional reactions. They were based on my survival instinct. My childhood experiences were not happy ones. I felt I had to protect myself from everyone. Thus, arguing and shutting up did nothing for me. I learned a new word for my instinctive reactions. It is the amygdala response. This part of the brain, the emotional part, is the survival instinct. The threat to survival is a strong emotion. My responses stemmed from my emotional base when I felt threatened. I need to train my brain from being controlled by the amygdala. I need to rewire my brain. This is called neuroplasticity. Neuroplasticity! It’s a new word to me. It means that the brain can be improved and strengthened. One can teach the brain to work in new ways. Being rigid and set in certain ways might not be productive. We can change our set of unproductive ideas and feelings to newer ones which are helpful and productive. Methods suggested are learning a new language, an instrument or doing something totally new. This would build our self-worth and make life comfortable emotionally.<\/p>\n<p>For active professionals, there are techniques and tools for handling stressful situations in the office, increasing output, creating a harmonious atmosphere, and ways to handle a difficult worker\/colleague. Using humor, a short break or changing sitting positions, etc. can lessen the difficult atmosphere. An unhappy environment is less productive. It guides you with ways to increase your positive feelings. This improves the ability to focus and concentrate on the goals. It talks about goals, gives steps to plan a goal, and is very well explained. The need for using technical skills and understanding emotions and emotional style so that sensible decisions can be made. And much more. I wish I had these tools when I was working.<\/p>\n<p>The course gives us tools to improve and develop our EI as it has a big impact on our relationships and professional success. We could certainly develop our EI if we use the methods suggested here. EI helps us recognize what’s happening within ourselves and emphasizes the need to deliberate before acting\/behaving\/reacting, socially or in our personal life. Act constructively!<\/p>\n<h2>Conclusion<\/h2>\n<figure id=\"attachment_83517\" aria-describedby=\"caption-attachment-83517\" style=\"width: 1024px\" class=\"wp-caption alignnone\"><img loading=\"lazy\" class=\"wp-image-83517 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Orientation-to-Power-Lab-John-Johnson.png\" alt=\"\" width=\"1024\" height=\"512\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Orientation-to-Power-Lab-John-Johnson.png 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Orientation-to-Power-Lab-John-Johnson-300x150.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Orientation-to-Power-Lab-John-Johnson-768x384.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption id=\"caption-attachment-83517\" class=\"wp-caption-text\">Orientation to Power Lab, emotional self assessment tool presented by John Johnson<\/figcaption><\/figure>\n<p>I have learned a lot from this course. Techniques to have a better grip on my emotions. Ways to train my brain to change to new ways of thinking. I feel more confident about myself and am sure I will deal with my emotions sensibly in the future. Think before you act is going to be my mantra!<\/p>\n<p>There were some typos which made it difficult to follow the meaning of a given sentence especially if you did not watch the videos. Ex: ‘Employers are emotional intelligence is a core power skill for the workplace.’ I also found references to books in between the lectures disturbing the flow of the thought. The lectures were a little rambling too. A huge portion of one lecture was spent discussing books which I felt could have been left to everyone to read, if they choose to. It took a chunk of time. A streamlined version would have been better for me.<\/p>\n<p>I was not in a graded course which gives you a certificate. So, I missed out on some very essential workshops which are useful for active professionals.<\/p>\n<p>Though this course explains that emotional intelligence is reading and managing our personal emotions and understanding how the other person feels and how to deal with it. Although this is crucial for successful interactions, it does not clarify what is EQ. I feel for clarity’s sake of the uninitiated it would be fruitful to explain that EQ is the level of emotional intelligence a person has. And it can be measured and improved upon. This course precisely deals with it and gives us tools and techniques to enhance our level of EI.<\/p>\n<p>Overall, the course gave me what I wanted!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how to improve your EQ in this course from University System of Maryland: Let’s Get Emotional &#8211; Emotions and Emotional Intelligence.<\/p>\n","protected":false},"author":161,"featured_media":83516,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[178],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions — Class Central<\/title>\n<meta name=\"description\" content=\"Learn how to improve your EQ in this course from University System of Maryland: Let’s Get Emotional - Emotions and Emotional Intelligence.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions\" \/>\n<meta property=\"og:description\" content=\"Learn how to improve your EQ in this course from University System of Maryland: Let’s Get Emotional - Emotions and Emotional Intelligence.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2022-12-07T17:59:22+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-12-07T17:59:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Nandita Ray\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor.png\",\"width\":1024,\"height\":512},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/\",\"name\":\"Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#primaryimage\"},\"datePublished\":\"2022-12-07T17:59:22+00:00\",\"dateModified\":\"2022-12-07T17:59:52+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/4893a2ed14ef958733b865f1cd0135ba\"},\"description\":\"Learn how to improve your EQ in this course from University System of Maryland: Let’s Get Emotional - Emotions and Emotional Intelligence.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/4893a2ed14ef958733b865f1cd0135ba\",\"name\":\"Nandita Ray\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/10\/Nandita-Ray-120x120.jpg\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/10\/Nandita-Ray-120x120.jpg\",\"caption\":\"Nandita Ray\"},\"description\":\"I am a retired teacher with a PhD in English. I taught in multiple middle and lower school grades in India. I also established and ran a non-profit organization teaching Functional Literacy to roadside children in New Delhi, worked with suicidal and depressed individuals at Sumaitri in New Delhi, and taught EHL courses to adult immigrants at the Hmong American Partnership (HAP) in St. Paul, MN.\",\"url\":\"https:\/\/www.classcentral.com\/report\/author\/nandita-ray\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions — Class Central","description":"Learn how to improve your EQ in this course from University System of Maryland: Let’s Get Emotional - Emotions and Emotional Intelligence.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/","og_locale":"en_US","og_type":"article","og_title":"Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions","og_description":"Learn how to improve your EQ in this course from University System of Maryland: Let’s Get Emotional - Emotions and Emotional Intelligence.","og_url":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2022-12-07T17:59:22+00:00","article_modified_time":"2022-12-07T17:59:52+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Nandita Ray","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/11\/University-System-of-Maryland_-Lets-Get-Emotional-Emotions-and-Emotional-Intelligence-Instructor.png","width":1024,"height":512},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#webpage","url":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/","name":"Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#primaryimage"},"datePublished":"2022-12-07T17:59:22+00:00","dateModified":"2022-12-07T17:59:52+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/4893a2ed14ef958733b865f1cd0135ba"},"description":"Learn how to improve your EQ in this course from University System of Maryland: Let’s Get Emotional - Emotions and Emotional Intelligence.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/review-lets-get-emotional\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"Improve Your Level of Emotional Intelligence And Get A Better Grip Of Your Emotions"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/4893a2ed14ef958733b865f1cd0135ba","name":"Nandita Ray","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/10\/Nandita-Ray-120x120.jpg","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/10\/Nandita-Ray-120x120.jpg","caption":"Nandita Ray"},"description":"I am a retired teacher with a PhD in English. I taught in multiple middle and lower school grades in India. I also established and ran a non-profit organization teaching Functional Literacy to roadside children in New Delhi, worked with suicidal and depressed individuals at Sumaitri in New Delhi, and taught EHL courses to adult immigrants at the Hmong American Partnership (HAP) in St. Paul, MN.","url":"https:\/\/www.classcentral.com\/report\/author\/nandita-ray\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/83515"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/161"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=83515"}],"version-history":[{"count":3,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/83515\/revisions"}],"predecessor-version":[{"id":83558,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/83515\/revisions\/83558"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/83516"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=83515"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=83515"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=83515"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}